{
  "stg_external_circle_circle_event": [
    {
      "category": null,
      "created_at": "2025-05-20T14:44:56.211",
      "duration_minutes": null,
      "end_at": "2025-06-04T20:00:00",
      "event_description": "Bem-vindo ao primeiro encontro da Logos Circle Lisbon!\nDesde a crise da habitação e insegurança alimentar até à autonomia digital e ao capitalismo de vigilância, acreditamos que a mudança real começa ao nível local. Este primeiro evento é uma oportunidade para conhecer e conectar com os teus pares, alinhar propósitos e começar a lançar as bases para projectos com impacto. Todos são bem-vindos, quer já queiras envolver-te activamente ou estejas apenas curioso para saber mais.\nAgenda\nBebidas e petiscos de boas-vindas\nAproveita snacks e bebidas de origem local enquanto nos cumprimentamos e nos instalamos.\nApresentações\nConhece os Admins da Logos Circle Lisbon. Serás convidado a partilhar um pouco da tua história e o que torna este trabalho significativo para ti.\nFoco em questões locais\nUma conversa sobre iniciativas locais já em curso, desafios emergentes e como a Logos pode apoiar através da acção social.\nDespedida\nPartilharemos o plano de acção para te envolveres e quando nos voltamos a encontrar.\nSobre a Logos\nA Logos é uma stack tecnológica totalmente descentralizada, que preserva a privacidade e é politicamente neutra. A stack inclui três protocolos modulares e descentralizados: Nomos (consensus), Codex (storage) e Waku (mensagens). Juntos, oferecem a base técnica para cibersistemas, sociedades paralelas, network states ou qualquer instituição pública sem fronteiras baseada no consentimento voluntário.\nA Logos é também um conjunto de comunidades de aprendizagem que governarão e sustentarão a rede no espírito dos cypherpunks originais. Juntas, formam o movimento de base necessário para construir as instituições sociais, económicas e de governação que viverão sobre esta stack tecnológica.\nCom o tempo, estas instituições irão formar um mercado competitivo capaz de colmatar falhas na governação do mundo real, oferecendo serviços públicos resistentes à corrupção e baseados na confiança mínima, onde quer que a internet chegue.\nLê o nosso manifesto para mergulhar mais a fundo nos nossos ideais e tecnologia.\n\nWelcome to the first gathering of the Logos Circle Lisbon!\nFrom housing and food insecurity to digital autonomy and surveillance capitalism, we believe real change starts at the local level. This first event is a chance to meet and connect with your peers, align on purpose, and begin laying the groundwork for projects that matter. Everyone is welcome, whether you're ready to get involved or just curious to learn more.\nAgenda\nWelcome drinks and snacks\nEnjoy locally sourced snacks and drinks while we say hello and settle in.\nIntroductions\nGet to know your local Logos Circle Admins. You’ll be invited to share a bit about your story and why this work is meaningful to you.\nFocus on local issues\nA discussion about local initiatives already underway, emerging challenges, and how Logos can support through social action.\nFarewell!\nWe’ll share the roadmap for how you can get involved and when we’ll gather again.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-TsladDcBnUwY1xz",
      "event_name": "Logos Circle Lisbon",
      "event_status": null,
      "event_timezone": "Europe/Lisbon",
      "event_type": null,
      "event_url": "https://luma.com/LCLisbon1",
      "event_visibility": "public",
      "geo_latitude": 38.732849,
      "geo_longitude": -9.149735,
      "guest_count": 63,
      "host_name": null,
      "host_username": null,
      "location_city": "Lisboa",
      "location_country": "Portugal",
      "max_capacity": null,
      "start_at": "2025-06-04T18:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-06-06T11:28:44.735",
      "duration_minutes": null,
      "end_at": "2025-06-08T17:00:00",
      "event_description": "O Logos Circle Lisboa está animado por participar na nossa primeira ação de voluntariado para retribuir à comunidade! Junta-te a nós para apoiar criativos locais, e se tens ideias sobre como a tecnologia descentralizada pode ajudar a valorizar o seu trabalho, queremos muito ouvi-las.\nSobre o Encontro\nQuem disse que pausa criativa significa parar? A partir deste domingo, 8 de Junho, começamos os nossos encontros semanais de detox digital - momentos para mexer na terra, construir com as mãos e repensar o espaço do Arroz juntes.\n\nA primeira sessão (14h) será para conversarmos sobre o plano, fazer alguma limpeza e começar a dar forma a este projeto comunitário.\nNas próximas semanas: recolher materiais, construir estruturas e criar o jardim que queremos ver crescer.\n\nJuntámos tudo num grupo de WhatsApp para combinarmos tarefas, trocar ideias e mantermos uma comunicação próxima.\n\nTragam roupa velha e vontade de meter as mãos na massa.\nhttps://chat.whatsapp.com/GrAmaKwj4Cf1RJ9nVsJpp1?fbclid=PAZXh0bgNhZW0CMTEAAadPF4pbLYu5nUPc9PHx6bGBQdnvkPum_4ofJhLJ8hrRxfGpsudvQZbnmjDlzA_aem_DF2uWzIYEvAQAFn8SyfBcQ\n\nThe Logos Lisbon Circle is excited to participate in our first volunteer action to give back to the community!\nJoin us as we show support for local creatives, and if you’ve got ideas for how decentralised tech can help elevate their work, we’d love to hear from you.\nAbout the Meetup\nCreative pause doesn’t mean stopping. Starting this Sunday, June 8th, we’re hosting weekly digital detox meet-ups - moments to dig in the soil, build with our hands, and reimagine Arroz’s space together.\n\nThe first session at 14h will be for discussing plans, some cleaning, and shaping this community project.\nIn the coming weeks: collecting materials, building structures, and growing the garden we want to see flourish.\n\nWe’ve set up a WhatsApp group (link in bio) to coordinate tasks, share ideas and keep communication direct\n\nBring old clothes and a readiness to get your hands dirty.\nhttps://chat.whatsapp.com/GrAmaKwj4Cf1RJ9nVsJpp1?fbclid=PAZXh0bgNhZW0CMTEAAadPF4pbLYu5nUPc9PHx6bGBQdnvkPum_4ofJhLJ8hrRxfGpsudvQZbnmjDlzA_aem_DF2uWzIYEvAQAFn8SyfBcQ",
      "event_id": "evt-teCVLJRcZPwDuRK",
      "event_name": "Logos Circle Lisbon: Digital detox session at Arroz Estúdios",
      "event_status": null,
      "event_timezone": "Europe/Lisbon",
      "event_type": null,
      "event_url": "https://luma.com/LCLisbonV1",
      "event_visibility": "public",
      "geo_latitude": 38.725957,
      "geo_longitude": -9.110857,
      "guest_count": 59,
      "host_name": null,
      "host_username": null,
      "location_city": "Lisboa",
      "location_country": "Portugal",
      "max_capacity": null,
      "start_at": "2025-06-08T13:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-05-14T15:33:09.154",
      "duration_minutes": null,
      "end_at": "2025-06-12T20:00:00",
      "event_description": "About the Event\nBuilders, technologists, cypherpunks, and free thinkers: we invite you to the first edition of Logos Circles Meetup Brno!\n\nThis DevConf.cz side event opens up a new Logos Circles group in Brno. It is an opportunity for our community and anyone interested to join Logos core contributor Václav Pavlín to discuss technical and philosophical topics at the intersection of human governance and blockchain technology in relaxed surroundings.\nTogether, we can realise the latent cypherpunk dream of a cyberstate or network state via a fully decentralised, privacy-preserving, and politically neutral technology stack.\nSign up to join us on 12th June 2025 for drinks and stimulating discussions.\nProgramme:\n18:00 - 19:00: Drinks and discussion\n19:00 - 20:00: From Parallel Polis to Decentralised Governance – fun exercise, quick presentation and a discussion on the future of human organisation\n21:00: Soft close\nFrom Parallel Polis to Decentralised Governance\nVáclav Benda wrote “Parallel Polis” in 1978 during the dark days of communist oppression. He tried to summarise how a parallel polis – or second culture – can thrive in the context of an authoritarian state. The world has changed since 1978, but the need for parallel societies lives on and will continue as long as governments fail to adequately support their citizens.\nLet’s discuss what we can learn from Parallel Polis and how to apply the strongest ideas to our current context. How can we build a better future and administer governance that serves us as individuals and our communities? Is decentralisation the path forward? Are blockchain technologies the solution? How are these technologies and governance models even related to Parallel Polis?\nFirst, we’ll do a fun exercise - guided imagery, then provide historical background with a short presentation before discussing the opportunities presented by recent technological breakthroughs in the context of human governance.\nLimited capacity | Registration required\nAbout Logos\nLogos is an open-source community building a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyberstates, parallel societies, network states, or any borderless public institution based on voluntary consent.\nAs a community, Logos not only develops and maintains these technologies but also uses them as a base to deploy parallel governance institutions to those mandated by nation states. Eventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach. If these ideas speak to you, we hope you will contribute your passion and skills to Logos.\nRead our manifesto to dive deeper into our ideals and technology.\nGet involved by joining our Discord.",
      "event_id": "evt-qJrkvD1gEneT5k2",
      "event_name": "Logos Circles Meetup Brno",
      "event_status": null,
      "event_timezone": "Europe/Prague",
      "event_type": null,
      "event_url": "https://luma.com/LCBrno1",
      "event_visibility": "public",
      "geo_latitude": 49.207708,
      "geo_longitude": 16.603785,
      "guest_count": 87,
      "host_name": null,
      "host_username": null,
      "location_city": "Brno-město",
      "location_country": "Czechia",
      "max_capacity": null,
      "start_at": "2025-06-12T16:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-06-16T11:16:49.38",
      "duration_minutes": null,
      "end_at": "2025-07-02T20:30:00",
      "event_description": "Bem-vindo ao segundo encontro da Logos Circle Lisbon!\nDesde a insegurança alimentar e os desafios da habitação até à autonomia digital e ao capitalismo de vigilância, acreditamos que a mudança real começa ao nível local. Este Circle é uma oportunidade para aprofundar ligações, dar seguimento às histórias levantadas no último encontro e dar as boas-vindas a novos membros.\nQuer já estejas pronto para te envolver ou apenas curioso para saber mais, és bem-vindo.\nAgenda\nChegada & Bebidas\nRecebe uma bebida e aproveita para conversar, fazer perguntas ou conhecer novas pessoas antes de começarmos.\nApresentações\nDamos início com uma recepção aos novos participantes e reintrodução do grupo. Será convidado a partilhar um pouco sobre o seu percurso e o que o/a trouxe até aqui.\nDiscussão em Círculo\nBreve resumo do último encontro e atualizações sobre as “histórias ganháveis” em curso\nConversa aberta sobre novas questões e ideias para possíveis iniciativas\nPartilha de competências e oportunidades de colaboração\nEncerramento\nPartilhamos os próximos passos, responsabilidades e relembramos que o Logos Circle se reúne na primeira quarta-feira de cada mês.\nSobre a Logos\nA Logos é uma stack tecnológica totalmente descentralizada, que preserva a privacidade e é politicamente neutra. A stack inclui três protocolos modulares e descentralizados: Nomos (consensus), Codex (storage) e Waku (mensagens). Juntos, oferecem a base técnica para cibersistemas, sociedades paralelas, network states ou qualquer instituição pública sem fronteiras baseada no consentimento voluntário.\nA Logos é também um conjunto de comunidades de aprendizagem que governarão e sustentarão a rede no espírito dos cypherpunks originais. Juntas, formam o movimento de base necessário para construir as instituições sociais, económicas e de governação que viverão sobre esta stack tecnológica.\nCom o tempo, estas instituições irão formar um mercado competitivo capaz de colmatar falhas na governação do mundo real, oferecendo serviços públicos resistentes à corrupção e baseados na confiança mínima, onde quer que a internet chegue.\nLê o nosso manifesto para mergulhar mais a fundo nos nossos ideais e tecnologia.\n\nWelcome to the second gathering of the Logos Circle Lisbon!\nFrom food insecurity and housing struggles to digital autonomy and surveillance capitalism, we believe meaningful change begins at the local level. This Circle is a chance to deepen our connections, follow up on stories raised last time, and welcome new members into the conversation.\nWhether you’re ready to contribute or just curious to learn more, you’re invited.\nAgenda\nArrival & Beverages\nSettle in with a selection of drinks and take some time to reconnect, meet new people, or ask questions.\nIntroductions\nWe’ll kick off by welcoming new participants and reintroducing ourselves. You’ll be invited to share a little about your background and what brings you here.\nCircle Discussion\nQuick recap of last session and updates on active “winnable stories”\nGroup discussion on emerging issues and ideas for possible new initiatives\nOpen floor for skills-sharing and collaboration\nWrap-up\nWe’ll share next steps, responsibilities, and any volunteering opportunities that arise. We'll also share a reminder that the Logos Circle Lisbon meets on the first Wednesday of every month.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-2O3VDu20tReoAIv",
      "event_name": "Logos Circle Lisbon",
      "event_status": null,
      "event_timezone": "Europe/Lisbon",
      "event_type": null,
      "event_url": "https://luma.com/LCLisbon2",
      "event_visibility": "public",
      "geo_latitude": 38.71642430000001,
      "geo_longitude": -9.1384666,
      "guest_count": 78,
      "host_name": null,
      "host_username": null,
      "location_city": "Lisboa",
      "location_country": "Portugal",
      "max_capacity": null,
      "start_at": "2025-07-02T18:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-06-23T17:43:10.107",
      "duration_minutes": null,
      "end_at": "2025-07-10T19:30:00",
      "event_description": "Welcome to the first gathering of the Logos Circle London!\nFrom housing and food insecurity to digital autonomy and surveillance capitalism, we believe real change starts at the local level. This first event is a chance to meet and connect with your peers, align on purpose, and begin laying the groundwork for projects that matter. Everyone is welcome, whether you're ready to get involved or just curious to learn more.\nAgenda\nWelcome drinks and snacks\nSettle in with snacks and drinks. Take time to meet others and ease into the space.\nIntroductions\nMeet your local Logos Circle Admins and fellow participants. You’ll be invited to share a bit of your story — why you’re here and what draws you to this work.\nIntro to Logos & Network States\nA short talk from the Circle Admins: what is Logos, why are we building network states, and how this can drive real local change, followed by an open Q&A.\nSurfacing local issues\nA group discussion on local issues, emerging challenges, and active initiatives. Together we’ll explore where Logos tools and networks can support real-world action.\nNext steps & farewell\nWe’ll close with a clear roadmap: how you can stay involved, take action, and when we’ll gather again.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-99QHqo8ZtbtENzC",
      "event_name": "Logos Circle London",
      "event_status": null,
      "event_timezone": "Europe/London",
      "event_type": null,
      "event_url": "https://luma.com/LogosCirclesLondon",
      "event_visibility": "public",
      "geo_latitude": 51.52396510000001,
      "geo_longitude": -0.07492,
      "guest_count": 50,
      "host_name": null,
      "host_username": null,
      "location_city": "London",
      "location_country": "UK",
      "max_capacity": null,
      "start_at": "2025-07-10T16:30:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-07-04T15:32:58.651",
      "duration_minutes": null,
      "end_at": "2025-07-21T10:00:00",
      "event_description": "Welcome to the first Logos Circle in Zanzibar!\nWe're excited to host this first Logos Circle in Zanzibar, taking place alongside Zanzalu.\nThis gathering is part of a growing network of Logos Circles around the world that explore how decentralised tools, local knowledge, and collective action can help solve real-world issues from the ground up.\nFor this session, we’ll focus on Tanzania’s employment crisis, one of the most pressing challenges facing the country. Our goal is to begin mapping the issue together, get to know each other’s skills and experiences, and lay the groundwork for local solutions that can grow beyond this event.\nEveryone’s welcome, whether you’re deeply involved in this issue already or just curious to learn and contribute.\n\nAgenda\nArrival + Opening Circle\nWelcome drinks and introductions.\nWhat is Logos & What Are Circles?\nA short intro to Logos: the technology stack, the network state vision, and how Circles act as entry points for local action.\nUnderstanding the Employment Crisis\nA collective mapping of the problem: what do we know about youth unemployment, informal work, and access to economic opportunity in Tanzania? What’s already being done and what’s missing?\nSkills Exchange + Group Discussion\nLet’s get to know each other better. What strengths, networks, or lived experience do we each bring to the table? Where could collaboration happen?\nWrap Up + What’s Next\nWe’ll outline the next steps and invite everyone to the evening session.\n\nEvening Workshop @ Johnnie’s Café (18:00)\nThis more hands-on session will explore practical responses to the challenges discussed earlier in the day. We’ll break into smaller groups to generate project ideas, sketch out roles, and build momentum toward pilot solutions.\n\nAbout Logos\nLogos is a sovereign, decentralised technology stack that realises the cypherpunk vision of autonomous digital territories and network states. It is designed to champion personal liberties and collective abundance through upgrading human governance.\nAbout Zanzalu\nZanzalu is a pop-up city located in Fumba Town, Zanzibar that brings together builders, artists, entrepreneurs, and researchers from across Africa and beyond. Our mission is to help build the innovation ecosystem in East Africa. Over several weeks, participants live, work, and co-create in community, exploring themes related to frontier tech, innovative governance, and the cities of tomorrow.",
      "event_id": "evt-fmg7R3zHlgCqDiM",
      "event_name": "Logos Circle: Zanzibar",
      "event_status": null,
      "event_timezone": "Africa/Dar_es_Salaam",
      "event_type": null,
      "event_url": "https://luma.com/LCZanzibar1",
      "event_visibility": "public",
      "geo_latitude": -6.280284699999999,
      "geo_longitude": 39.2512913,
      "guest_count": 3,
      "host_name": null,
      "host_username": null,
      "location_city": "Zanzibar",
      "location_country": "Tanzania",
      "max_capacity": null,
      "start_at": "2025-07-21T08:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-07-04T16:23:59.017",
      "duration_minutes": null,
      "end_at": "2025-07-21T17:00:00",
      "event_description": "Join this Logos Circle for a practical workshop focused on equipping you to lead change in your local community.\nWhether you've already hosted a meetup or you're just curious about stepping up, this workshop is all about sharing what we've learned so far (what works, what doesn’t) and giving you the tools to launch and grow a Logos Circle in your city. You'll leave with practical resources, inspiration from others, and a clear sense of next steps.\nThis session is part of the wider Zanzalu initiative—an evolving network of temporary, experimental communities rooted in local action and global collaboration.\n\nAgenda\nWelcome\nSettle in, meet the group, and hear a short intro on how this session fits into the broader Logos & Zanzalu movement.\nWhy Circles?\nA brief overview of the purpose and structure of Logos Circles, and how they tie into local organising and global change.\nTools, templates & tactics\nWe'll walk through everything from how to structure your first meetup, to surfacing winnable issues, and sustaining momentum.\nStories from the field\nHear real examples of Circles already underway—what’s worked, what hasn’t, and what they’ve learned.\nOpen discussion & support\nBring your own context (city, group, idea) and we’ll workshop next steps together.\nClosing & roadmap\nLeave with a clear plan, resources to take home, and ways to stay supported by the wider network.\n\nAbout Logos\nLogos is a sovereign, decentralised technology stack that realises the cypherpunk vision of autonomous digital territories and network states. It is designed to champion personal liberties and collective abundance through upgrading human governance.\nAbout Zanzalu\nZanzalu is a pop-up city located in Fumba Town, Zanzibar that brings together builders, artists, entrepreneurs, and researchers from across Africa and beyond. Our mission is to help build the innovation ecosystem in East Africa. Over several weeks, participants live, work, and co-create in community, exploring themes related to frontier tech, innovative governance, and the cities of tomorrow.",
      "event_id": "evt-T9dfXoPQ0Yc2QJ0",
      "event_name": "Logos Circle: Zanzibar",
      "event_status": null,
      "event_timezone": "Africa/Nairobi",
      "event_type": null,
      "event_url": "https://luma.com/LCZanzibar2",
      "event_visibility": "public",
      "geo_latitude": null,
      "geo_longitude": null,
      "guest_count": 0,
      "host_name": null,
      "host_username": null,
      "location_city": null,
      "location_country": null,
      "max_capacity": null,
      "start_at": "2025-07-21T15:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-07-04T15:50:53.925",
      "duration_minutes": null,
      "end_at": "2025-07-28T10:00:00",
      "event_description": "This workshop picks up where our last session session left off. After mapping out the roots of Tanzania’s employment crisis and understanding the skills in the room, we’ll shift into a plan of action for how we can begin tackling this issue.\nThis session is part of Zanzalu, a temporary gathering space for builders, organisers, and dreamers shaping new ways of living and working. Logos Circles are local, community-led spaces for exploring how decentralised tech can support real-world challenges.\n\nAgenda\nArrival & Welcome\nGrab a drink, settle in, and meet others. Informal check-in for those who missed the previous session.\nRecap from Day Session\nQuick overview of what was discussed last session:\nRoots of Tanzania’s employment crisis\nKey themes and challenges surfaced\nSkills and interests in the room\nFraming the Challenge\nGroup discussion: What real interventions feel possible?\nHow can we support youth employment, entrepreneurship, or community-led solutions?\nBreakout: Project Jam\nSmall group working sessions:\nPick a focus area (e.g. skills mapping, microgrants, creative economy)\nSketch out one practical initiative\nIdentify what’s needed (people, partners, tech, funding, etc.)\nShareback & Feedback\nEach group shares their idea in a couple of minutes.\nOpen floor for feedback, additions, and offers of support.\nNext Steps\nHow to stay involved and continue working on ideas throughout the duration of Zanzalu and beyond.\nClose & Hangout\nStick around to chat and connect.\n\nAbout Logos\nLogos is a sovereign, decentralised technology stack that realises the cypherpunk vision of autonomous digital territories and network states. It is designed to champion personal liberties and collective abundance through upgrading human governance.\nAbout Zanzalu\nZanzalu is a pop-up city located in Fumba Town, Zanzibar that brings together builders, artists, entrepreneurs, and researchers from across Africa and beyond. Our mission is to help build the innovation ecosystem in East Africa. Over several weeks, participants live, work, and co-create in community, exploring themes related to frontier tech, innovative governance, and the cities of tomorrow.",
      "event_id": "evt-fIlu6KG35FMaJSL",
      "event_name": "Logos Circle: Zanzibar",
      "event_status": null,
      "event_timezone": "Africa/Dar_es_Salaam",
      "event_type": null,
      "event_url": "https://luma.com/LCZanzibar3",
      "event_visibility": "public",
      "geo_latitude": -6.280284699999999,
      "geo_longitude": 39.2512913,
      "guest_count": 1,
      "host_name": null,
      "host_username": null,
      "location_city": "Zanzibar",
      "location_country": "Tanzania",
      "max_capacity": null,
      "start_at": "2025-07-28T08:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-07-04T16:33:27.359",
      "duration_minutes": null,
      "end_at": "2025-07-28T17:00:00",
      "event_description": "This final Logos Circle of Zanzalu offers a moment to pause, reflect, and prepare for what comes next. Through the Circles, we’ve explored bold ideas, tackled complex problems like Tanzania’s employment crisis, and grown as leaders and collaborators. Now it’s time to take stock and start translating it all into action beyond Zanzalu.\nWhether you’re continuing work on a specific project, starting a Circle in your city, or still figuring out your next move, this is a space to share, learn from each other, and align on how we carry this momentum forward.\n\nAgenda\nWelcome & Arrival\nA gentle open-in reconnecting as a group.\nWhat We’ve Learned\nA guided group reflection to surface key takeaways, breakthroughs, and lessons from the past week.\nProject Spotlights\nParticipants share updates on active workstreams (e.g. Tanzanian employment), what’s working, and where support is needed.\nCarrying It Forward\nCollaboratively mapping next steps: launching Circles, continuing projects, and staying connected after Zanzalu.\nClose & Commitments\nWe’ll finish with a round of personal commitments and acknowledgements, small or big, individual or collective.\n\nAbout Logos\nLogos is a sovereign, decentralised technology stack that realises the cypherpunk vision of autonomous digital territories and network states. It is designed to champion personal liberties and collective abundance through upgrading human governance.\nAbout Zanzalu\nZanzalu is a pop-up city located in Fumba Town, Zanzibar that brings together builders, artists, entrepreneurs, and researchers from across Africa and beyond. Our mission is to help build the innovation ecosystem in East Africa. Over several weeks, participants live, work, and co-create in community, exploring themes related to frontier tech, innovative governance, and the cities of tomorrow.",
      "event_id": "evt-YaNlg552dtAYOsH",
      "event_name": "Logos Circle: Zanzibar",
      "event_status": null,
      "event_timezone": "Africa/Nairobi",
      "event_type": null,
      "event_url": "https://luma.com/LCZanzibar4",
      "event_visibility": "public",
      "geo_latitude": null,
      "geo_longitude": null,
      "guest_count": 1,
      "host_name": null,
      "host_username": null,
      "location_city": null,
      "location_country": null,
      "max_capacity": null,
      "start_at": "2025-07-28T15:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-10-28T18:44:27.749",
      "duration_minutes": null,
      "end_at": "2025-11-07T02:00:00",
      "event_description": "¡Bienvenidos al segundo Logos Circle en San José, Costa Rica!\nCosta Rica se posiciona como líder en innovación tecnológica y sostenibilidad en América Latina. Es el momento perfecto para explorar las sociedades paralelas, digitales y soberanas e impulsar un impacto colectivo real desde nuestra región.\nLogos en colaboración con DecentralU y Dojo Coding se unen para reunir a cypherpunks, builders, tecnólogos, artistas, periodistas, activistas y líderes comunitarios para crear un espacio regular de diálogo, colaboración y acción sobre los temas que más nos importan.\n¿Te interesa la privacidad digital, la descentralización y construir el futuro de la web? Este es tu lugar.\n\nAgenda\nBebidas & snacks – Bienvenida y encuentro.\nPresentaciones – Organizadores y participantes.\nLogos & Sociedades Paralelas – Introducción + Q&A.\nTemas locales – Retos e iniciativas a desarrollar.\nPróximos pasos – Hoja de ruta y cierre.\n\n¿Qué es Logos?\nLogos un movimiento y tecnología para empoderar a una generación de pioneros digitales que transformen la privacidad y la autonomía de ideales a realidades.\nDesarrollamos protocolos descentralizados para:\nGovernance (Nomos) - Consenso privado y soberano\nStorage (Codex) - Almacenamiento resistente a la censura\nMessaging (Waku) - Comunicaciones privadas y escalables\nEstos forman la base tecnológica para sociedades paralelas y instituciones sin fronteras basadas en el consentimiento voluntario.\nComo movimiento de base, Logos construye comunidades locales que sostienen la red en el espíritu de los cypherpunks originales.\nLee nuestro manifiesto para saber más →\n\nConoce a nuestros partners:\n¿Qué es DecentralU?\nDecentralU es una comunidad creada para impulsar carreras profesionales en Web3, con mentores que han estado allí y conexiones que abren puertas. Somos el HUB de oportunidades Web3: abrimos la puerta a quienes buscan algo mejor y quieren construir su futuro en este nuevo ecosistema.\n¿Qué es Dojo Coding?\nDojo Coding es la comunidad de developers más grande de LATAM. Conectamos talento con tecnologías emergentes como Web3 y AI, y actuamos como incubadora de proyectos para impulsar la próxima generación de builders innovadores.\n\n¿Quién debería asistir?\nDesarrolladores interesados en tecnologías emergentes\nTecnólogos que valoran la privacidad y descentralización\nEmprendedores explorando nuevos modelos de negocio\nActivistas trabajando en derechos digitales\nEstudiantes curiosos sobre el futuro de internet\nCualquier persona interesada en construir un futuro más libre y descentralizado\nNo se requiere experiencia previa.\nÚnete al Telegram oficial de Logos, si tienes preguntas hazlas en el canal San Jose-Circle",
      "event_id": "evt-VbISelxeshCSkOW",
      "event_name": "Logos Circles San José (Costa Rica) - Chapter 2",
      "event_status": null,
      "event_timezone": "America/Costa_Rica",
      "event_type": null,
      "event_url": "https://luma.com/qmp9dkef",
      "event_visibility": "public",
      "geo_latitude": 9.939377499999999,
      "geo_longitude": -84.11404259999999,
      "guest_count": 23,
      "host_name": null,
      "host_username": null,
      "location_city": "San José",
      "location_country": "Costa Rica",
      "max_capacity": null,
      "start_at": "2025-11-07T00:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-07-14T12:32:53.78",
      "duration_minutes": null,
      "end_at": "2025-08-05T18:00:00",
      "event_description": "Join us for a relaxed summer hangout with the Logos Brno Lisbon!\nWe’ll bring some snacks and drinks, feel free to bring something to share too.\nThis summer Circle will be a more relaxed and informal gathering, focused on connection. It’s a chance to catch up, hear what everyone’s been working on, and continue discussing local issues and how we can support them.\nAgenda\nWelcome\nGrab a drink, catch up with familiar faces and meet new ones.\nCircle check-in\nQuick intros (for any new folks) and an update on what’s been happening since the last meetup.\nLocal issues discussion\nWhat local issues are people in the Circle working on? What local issues resonate with you?\nOpen chat & ideation\nSit in smaller groups, go deep on something that interests you.\nNext steps & invites\nWe'll share what’s coming up, how to stay involved, and how we can work towards establishing our winnable issue.\n\nAbout Logos\nLogos is a sovereign, decentralised technology stack that realises the cypherpunk vision of autonomous digital territories and network states. It is designed to champion personal liberties and collective abundance through upgrading human governance.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-DHmmRoMNsVMrwO2",
      "event_name": "Logos Circle: Brno",
      "event_status": null,
      "event_timezone": "Europe/Prague",
      "event_type": null,
      "event_url": "https://luma.com/lcbrno2",
      "event_visibility": "public",
      "geo_latitude": 49.2082531,
      "geo_longitude": 16.6338839,
      "guest_count": 30,
      "host_name": null,
      "host_username": null,
      "location_city": "Brno-město",
      "location_country": "Czechia",
      "max_capacity": null,
      "start_at": "2025-08-05T16:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-07-08T19:46:19.848",
      "duration_minutes": null,
      "end_at": "2025-08-06T19:00:00",
      "event_description": "Join us for a relaxed summer hangout with the Logos Circle Lisbon!\nWe’ll bring some snacks and drinks, feel free to bring something to share too.\nThis summer Circle will be a more relaxed and informal gathering, focused on connection. It’s a chance to catch up, hear what everyone’s been working on, and share updates on the winnable issues we’ve been exploring together.\nAgenda\nWelcome\nFind a spot in the shade, grab a drink, catch up with familiar faces and meet new ones.\nCircle check-in\nQuick intros (for any new folks) and an update on what’s been happening since the last meetup.\nReview of winnable issues\nWhat’s moved forward? What needs support? Space to share updates and new ideas you’ve come across.\nOpen chat & ideation\nSit in smaller groups, go deep on something that interests you.\nNext steps & invites\nWe'll share what’s coming up, how to stay involved, and how we can support the winnable issues.\nBring a blanket and some snacks!\n\nAbout Logos\nLogos is a sovereign, decentralised technology stack that realises the cypherpunk vision of autonomous digital territories and network states. It is designed to champion personal liberties and collective abundance through upgrading human governance.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-BEX5y3AGLLXkJtu",
      "event_name": "Logos Circle: Lisbon",
      "event_status": null,
      "event_timezone": "Europe/Lisbon",
      "event_type": null,
      "event_url": "https://luma.com/LCLisbon3",
      "event_visibility": "public",
      "geo_latitude": 38.714765,
      "geo_longitude": -9.159257499999999,
      "guest_count": 98,
      "host_name": null,
      "host_username": null,
      "location_city": "Lisboa",
      "location_country": "Portugal",
      "max_capacity": null,
      "start_at": "2025-08-06T17:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-07-22T19:51:54.072",
      "duration_minutes": null,
      "end_at": "2025-08-21T05:00:00",
      "event_description": "The LA area's vibrant tech and creative community is perfectly positioned to explore network state concepts and drive collaborative social impact. Join us as we create a regular space for meaningful dialogue, relationship building, and collective action on the issues that matter most to our community.\n\nThe inaugural Logos Circle: Los Angeles event is an opportunity to connect, align on shared purpose, and start leveraging the Logos tech stack for projects that can make a real difference in LA. Everyone is welcome, whether you're ready to dive in or simply curious to explore.\nAgenda\nWelcome drinks and networking\nJoin us for refreshments as we gather and connect. Take time to meet fellow participants and settle into the space.\nIntroductions & community building\nMeet your local Logos Circle organizers and community members. You'll have the chance to share your story, what brought you here and what drives your interest in this movement.\nIntroduction to Logos & Network States\nA presentation from Chair covering the evolution from Bitcoin to Ethereum, to Status to Logos, exploring what network states are, why we're building them, and how they can drive tangible local impact. Open Q&A to follow.\nExploring LA's challenges & opportunities\nA collaborative discussion on local issues facing our community, emerging challenges, and existing initiatives. Together we'll identify where Logos tools and networks can support real world action in Los Angeles.\nLogos ecosystem showcase\nDiscover what's already been accomplished with existing Logos circles around the world and how we can build on their success here in LA.\nPlanning our path forward\nWe'll wrap up with concrete next steps: how to stay engaged, ways to contribute, and when we'll gather again to continue building our community.\nLogos swag & resources\nTake home Logos zines, stickers, and other goodies, plus get onboarded to our forums and discord communities.\n\n  About Logos\nLogos is a fully decentralized, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralized protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimized, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-WCyggRrero1YeqV",
      "event_name": "Logos Circle: Los Angeles",
      "event_status": null,
      "event_timezone": "America/Los_Angeles",
      "event_type": null,
      "event_url": "https://luma.com/vo03t8xj",
      "event_visibility": "public",
      "geo_latitude": 34.044711299999996,
      "geo_longitude": -118.2352851,
      "guest_count": 36,
      "host_name": null,
      "host_username": null,
      "location_city": "Los Angeles",
      "location_country": "USA",
      "max_capacity": null,
      "start_at": "2025-08-21T01:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-08-05T13:37:34.096",
      "duration_minutes": null,
      "end_at": "2025-09-03T20:00:00",
      "event_description": "Bem-vindo à edição de setembro do Círculo Logos Lisboa!\nDesde a insegurança alimentar e os desafios da habitação até à autonomia digital e ao capitalismo de vigilância, acreditamos que a mudança real começa ao nível local. Este Circle é uma oportunidade para aprofundar ligações, dar seguimento às histórias levantadas no último encontro e dar as boas-vindas a novos membros.\nQuer já estejas pronto para te envolver ou apenas curioso para saber mais, és bem-vindo.\nAgenda\nChegada & Bebidas\nRecebe uma bebida e aproveita para conversar, fazer perguntas ou conhecer novas pessoas antes de começarmos.\nApresentações\nDamos início com uma recepção aos novos participantes e reintrodução do grupo. Será convidado a partilhar um pouco sobre o seu percurso e o que o/a trouxe até aqui.\nDiscussão em Círculo\nBreve resumo do último encontro e atualizações sobre as “histórias ganháveis” em curso\nConversa aberta sobre novas questões e ideias para possíveis iniciativas\nPartilha de competências e oportunidades de colaboração\nEncerramento\nPartilhamos os próximos passos, responsabilidades e relembramos que o Logos Circle se reúne na primeira quarta-feira de cada mês.\nSobre a Logos\nA Logos é uma stack tecnológica totalmente descentralizada, que preserva a privacidade e é politicamente neutra. A stack inclui três protocolos modulares e descentralizados: Nomos (consensus), Codex (storage) e Waku (mensagens). Juntos, oferecem a base técnica para cibersistemas, sociedades paralelas, network states ou qualquer instituição pública sem fronteiras baseada no consentimento voluntário.\nA Logos é também um conjunto de comunidades de aprendizagem que governarão e sustentarão a rede no espírito dos cypherpunks originais. Juntas, formam o movimento de base necessário para construir as instituições sociais, económicas e de governação que viverão sobre esta stack tecnológica.\nCom o tempo, estas instituições irão formar um mercado competitivo capaz de colmatar falhas na governação do mundo real, oferecendo serviços públicos resistentes à corrupção e baseados na confiança mínima, onde quer que a internet chegue.\nLê o nosso manifesto para mergulhar mais a fundo nos nossos ideais e tecnologia.\n\nWelcome to the September edition of the Logos Circle Lisbon!\nFrom food insecurity and housing struggles to digital autonomy and surveillance capitalism, we believe meaningful change begins at the local level. This Circle is a chance to deepen our connections, follow up on stories raised last time, and welcome new members into the conversation.\nWhether you’re ready to contribute or just curious to learn more, you’re invited.\nAgenda\nArrival & Beverages\nSettle in with a selection of drinks and take some time to reconnect, meet new people, or ask questions.\nIntroductions\nWe’ll kick off by welcoming new participants and reintroducing ourselves. You’ll be invited to share a little about your background and what brings you here.\nCircle Discussion\nQuick recap of last session and updates on active “winnable stories”\nGroup discussion on emerging issues and ideas for possible new initiatives\nOpen floor for skills-sharing and collaboration\nWrap-up\nWe’ll share next steps, responsibilities, and any volunteering opportunities that arise. We'll also share a reminder that the Logos Circle Lisbon meets on the first Wednesday of every month.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-cTMUwlKHi2QPFxy",
      "event_name": "Logos Circle: Lisbon",
      "event_status": null,
      "event_timezone": "Europe/Lisbon",
      "event_type": null,
      "event_url": "https://luma.com/LCLisbon4",
      "event_visibility": "public",
      "geo_latitude": 38.71642430000001,
      "geo_longitude": -9.1384666,
      "guest_count": 107,
      "host_name": null,
      "host_username": null,
      "location_city": "Lisboa",
      "location_country": "Portugal",
      "max_capacity": null,
      "start_at": "2025-09-03T18:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-08-19T14:55:37.817",
      "duration_minutes": null,
      "end_at": "2025-09-09T18:30:00",
      "event_description": "Benvinguts al primer Logos Circle Barcelona\nLa comunitat tecnològica i creativa de Barcelona és l’espai perfecte per explorar els network states (estats en xarxa) i generar impacte col·lectiu. Amb el suport d’AKASHA Hub, reunim cypherpunks, tecnòlegs, artistes, periodistes, activistes, entitats locals i líders comunitaris.\nCreem un espai regular per al diàleg, la col·laboració i l’acció sobre els temes clau de la comunitat.\nIdiomes: anglès, castellà, català\nAgenda\nBegudes & snacks – Benvinguda i encontre.\nPresentacions – Organitzadors i participants.\nLogos & Network States – Introducció + Q&A.\nQüestions locals – Reptes i iniciatives.\nPròxims passos – Full de ruta i cloenda.\nSobre Logos\nLogos és una tecnologia i moviment descentralitzat, neutral i respectuós amb la privacitat. Impulsa protocols peer-to-peer de governança, arxiu i missatgeria — base dels network states (estats en xarxa) i institucions sense fronteres.\nCom a moviment de base, Logos construeix comunitats locals que sostenen la xarxa en l’esperit dels cypherpunks.\nLlegeix el nostre manifest per saber-ne més. \n\n______ \nBienvenidos al primer Logos Circle Barcelona\nLa comunidad tecnológica y creativa de Barcelona es el lugar ideal para explorar los network states (estados en red) e impulsar un impacto colectivo. Con el apoyo de AKASHA Hub, reunimos a cypherpunks, tecnólogos, artistas, periodistas, activistas, organizaciones locales y líderes comunitarios.\nCreamos un espacio regularmente para el diálogo, la colaboración y la acción en torno a los temas que más nos importan.\nIdiomas: inglés, español, catalán\nAgenda\nBebidas & snacks – Bienvenida y encuentro.\nPresentaciones – Organizadores y participantes.\nLogos & Network States – Introducción + Q&A.\nTemas locales – Retos e iniciativas.\nPróximos pasos – Hoja de ruta y cierre.\nSobre Logos\nLogos es una tecnología y movimiento descentralizado, neutral y orientado a la privacidad. Impulsa protocolos peer-to-peer de gobernanza, archivo y mensajería — base de los network states (estados en red) y de instituciones sin fronteras.\nComo movimiento de base, Logos crea comunidades locales que sostienen la red en el espíritu de los cypherpunks.\nLee nuestro manifiesto para saber más.\n______\nWelcome to the first Logos Circle Barcelona!\nBarcelona’s creative and tech community, rooted in its culture and history, is the perfect place to explore network states and drive collective impact. With support from AKASHA Hub, we gather cypherpunks, technologists, artists, journalists, activists, local charities and community leaders.\nJoin us to open a regular space for dialogue, collaboration, and action on the issues that matter most.\nLanguages: English, Spanish, Catalan\nAgenda\nDrinks & snacks – Meet and settle in.\nIntroductions – Organisers + participants share stories.\nLogos & Network States – Why we’re building them + Q&A.\nLocal issues – Group discussion on challenges & initiatives.\nNext steps – Roadmap and farewell.\nAbout Logos\nLogos is a decentralised, privacy-preserving, neutral technology and movement. It powers peer-to-peer protocols for governance, storage, and messaging — foundations for network states and borderless institutions.\nAs a grassroots movement, Logos builds local communities to sustain the network in the spirit of the cypherpunks.\nRead our manifesto to learn more.",
      "event_id": "evt-o6wisWubB6kt8oP",
      "event_name": "Logos Circle Barcelona",
      "event_status": null,
      "event_timezone": "Europe/Madrid",
      "event_type": null,
      "event_url": "https://luma.com/gb2tgwiq",
      "event_visibility": "public",
      "geo_latitude": 41.4109567,
      "geo_longitude": 2.1912024999999997,
      "guest_count": 60,
      "host_name": null,
      "host_username": null,
      "location_city": "Barcelona",
      "location_country": "Spain",
      "max_capacity": null,
      "start_at": "2025-09-09T16:30:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-09-03T08:33:15.252",
      "duration_minutes": null,
      "end_at": "2025-09-11T18:00:00",
      "event_description": "Join us for a relaxed end-of-summer hangout with the Logos Brno!\nThis will be a relaxed and informal gathering, focused on connection. It’s a chance to catch up, hear what everyone’s been working on, and continue discussing local issues and how we can support them.\nAgenda\nWelcome\nGrab a drink, catch up with familiar faces and meet new ones.\nCircle check-in\nQuick intros (for any new folks) and an update on what’s been happening since the last meetup.\nLocal issues discussion\nWhat local issues are people in the Circle working on? What local issues resonate with you?\nOpen chat & ideation\nSit in smaller groups, go deep on something that interests you.\nNext steps & invites\nWe'll share what’s coming up, how to stay involved, and how we can work towards establishing our winnable issue.\n\nAbout Logos\nLogos is a sovereign, decentralised technology stack that realises the cypherpunk vision of autonomous digital territories and network states. It is designed to champion personal liberties and collective abundance through upgrading human governance.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-HM9KRuaNlRBkWne",
      "event_name": "Logos Circle: Brno",
      "event_status": null,
      "event_timezone": "Europe/Prague",
      "event_type": null,
      "event_url": "https://luma.com/5scnq4ek",
      "event_visibility": "public",
      "geo_latitude": 49.2047119,
      "geo_longitude": 16.6117152,
      "guest_count": 13,
      "host_name": null,
      "host_username": null,
      "location_city": "Brno-město",
      "location_country": "Czechia",
      "max_capacity": null,
      "start_at": "2025-09-11T16:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-09-05T11:52:27.951",
      "duration_minutes": null,
      "end_at": "2025-09-12T18:00:00",
      "event_description": "Welcome to the first Logos Circle in Benin, Nigeria!\nWe’re excited to host this inaugural Logos Circle during The Grand Guild Dine and Discuss event.\nThis gathering is part of a growing network of Logos Circles around the world that explore how decentralised tools, local knowledge, and collective action can help solve real-world issues from the ground up.\nFor this first Benin Circle, we’ll use the Dine and Discuss space to connect, share experiences, and begin mapping out how Logos Circles in Nigeria can address pressing local challenges through community-driven solutions.\nEveryone is welcome—whether you’re already engaged in grassroots initiatives, experimenting with decentralised tools, or simply curious to learn and contribute.\nAgenda\nWhat is Logos & What Are Circles?\nAn introduction to Logos: the technology stack, the network state vision, and how Circles serve as entry points for local action.\nBenin in Focus\nAn open discussion on the opportunities and challenges facing communities in Benin City today. How can local knowledge, skills, and networks combine with decentralised tools to make a difference?\nSkills Exchange + Group Dialogue\nA chance to get to know each other better—what experience, talents, or perspectives do we each bring? Where could collaboration emerge?\nWrap Up + What’s Next\nOutlining possible next steps for the Benin Circle and inviting participants to stay connected as the local network grows.\nYou will need to get a ticket for this event through The Grand Guild registration page: https://lnkd.in/d8sNRnJ2\nAbout Logos\nLogos is a sovereign, decentralised technology stack that realises the cypherpunk vision of autonomous digital territories and network states. It is designed to champion personal liberties and collective abundance through upgrading human governance.\nAbout The Grand Guild\nThe Grand Guild is a platform for dialogue, culture, and exchange in Benin City. Its Dine and Discuss series brings together thinkers, doers, and community leaders to spark conversations and build connections that strengthen local impact.",
      "event_id": "evt-W2ZQLNQqfWlSbtw",
      "event_name": "Logos Circle: Benin",
      "event_status": null,
      "event_timezone": "Africa/Lagos",
      "event_type": null,
      "event_url": "https://luma.com/LCBenin1",
      "event_visibility": "public",
      "geo_latitude": 6.341210299999999,
      "geo_longitude": 5.619377999999999,
      "guest_count": 1,
      "host_name": null,
      "host_username": null,
      "location_city": "Benin City",
      "location_country": "Nigeria",
      "max_capacity": null,
      "start_at": "2025-09-12T16:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-09-19T18:41:17.925",
      "duration_minutes": null,
      "end_at": "2025-09-24T04:00:00",
      "event_description": "The objective for this session is to isolate, and begin meaningful work toward a solution for a local issue impacting the Los Angeles area, leveraging the Logos tech stack.\n\nAttendees from the first Logos Circle: Los Angeles session will have priority for reservation slots.\n\nhttps://logos.co\nhttps://logos.co/farewell-to-westphalia/",
      "event_id": "evt-BosUNGFenOYa8LE",
      "event_name": "Logos Circle: Los Angeles | Work Group Session",
      "event_status": null,
      "event_timezone": "America/Los_Angeles",
      "event_type": null,
      "event_url": "https://luma.com/9btmv8ls",
      "event_visibility": "public",
      "geo_latitude": 34.011882799999995,
      "geo_longitude": -118.4915504,
      "guest_count": 19,
      "host_name": null,
      "host_username": null,
      "location_city": "Santa Monica",
      "location_country": "USA",
      "max_capacity": null,
      "start_at": "2025-09-24T01:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-09-18T11:55:11.062",
      "duration_minutes": null,
      "end_at": "2025-10-03T16:00:00",
      "event_description": "Welcome to the first Logos Circle Prague, a special edition hosted at Dark Prague!\nFrom housing and food insecurity to digital autonomy and surveillance capitalism, we believe real change starts at the local level. This first event is a chance to meet and connect with your peers, align on purpose, and begin laying the groundwork for projects that matter. Everyone is welcome, whether you're ready to get involved or just curious to learn more.\nAgenda\nIntroductions\nGet to know your local Logos contributors. You’ll be invited to share a bit about your story and why this work is meaningful to you.\nDiscussion on Logos\nLearn more about Logos, Logos Circles, and how you can help pioneer the Prague Circle.\nFocus on local issues\nA discussion about local initiatives already underway, emerging challenges, and how Logos can support through collective action.\nFarewell!\nWe’ll share the roadmap for how you can get involved and when we’ll gather again.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.\nAbout Dark Prague\nTechnology is the battlefield. Biology is the frontier. Networks are the lifeblood. This is where we examine systems to dismantle them, fork them, or remake them.\nIn the flicker between freedom and control, shadows move. They are thinkers, builders, breakers, not invited, not waiting.\nThis is not a conference. This is a signal — low-res, high-risk, peer-to-peer.\nThe first of many to start the next chapter, a successor to the Hackers Congress Paralelní Polis core, now fed by the roots of life, the edge of science, and the code of exile.",
      "event_id": "evt-B5N1KfkcfbhVtWX",
      "event_name": "Logos Circle Prague",
      "event_status": null,
      "event_timezone": "Europe/Prague",
      "event_type": null,
      "event_url": "https://luma.com/deeg8ue8",
      "event_visibility": "public",
      "geo_latitude": 50.103352699999995,
      "geo_longitude": 14.450541099999997,
      "guest_count": 15,
      "host_name": null,
      "host_username": null,
      "location_city": "Hlavní město Praha",
      "location_country": "Czechia",
      "max_capacity": null,
      "start_at": "2025-10-03T15:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-09-18T13:30:49.559",
      "duration_minutes": null,
      "end_at": "2025-10-08T19:00:00",
      "event_description": "Welcome to the upcoming gathering of the Logos Circle Brno!\nFrom food insecurity and housing struggles to digital autonomy and surveillance capitalism, we believe meaningful change begins at the local level. This Circle is a chance to deepen our connections, follow up on stories raised last time, and welcome new members into the conversation.\nWhether you’re ready to contribute or just curious to learn more, you’re invited.\nAgenda\nArrival & Beverages\nSettle in with a selection of drinks and take some time to reconnect, meet new people, or ask questions.\nIntroductions\nWe’ll kick off by welcoming new participants and reintroducing ourselves. You’ll be invited to share a little about your background and what brings you here.\nCircle Discussion\nQuick recap of what Logos is and why we are here\nGroup discussion on emerging issues and ideas for possible new initiatives\nOpen floor for skills-sharing and collaboration\nSpecial Guest\nLogos co-founder Jarrad Hope will join us for this meetup, so you'll have a chance to pick his brain on parallel societies, cyberstate technology and the future of human governance.\nWrap-up\nWe’ll share next steps, responsibilities, and any volunteering opportunities that arise.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-o0sWkaHPQWlGwVz",
      "event_name": "Logos Circle Brno",
      "event_status": null,
      "event_timezone": "Europe/Prague",
      "event_type": null,
      "event_url": "https://luma.com/r27unul9",
      "event_visibility": "public",
      "geo_latitude": 49.1991063,
      "geo_longitude": 16.612291199999998,
      "guest_count": 15,
      "host_name": null,
      "host_username": null,
      "location_city": "Brno-město",
      "location_country": "Czechia",
      "max_capacity": null,
      "start_at": "2025-10-08T15:30:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-09-25T10:53:02.39",
      "duration_minutes": null,
      "end_at": "2025-10-08T19:30:00",
      "event_description": "Welcome to the Logos Circle London chapter!\nWe believe real change starts at the local level. This meetup is a chance to meet and connect with your peers, align on purpose, and begin laying the groundwork for projects that matter.\nJoin us in the heart of the city, next to St Paul's cathedral, in a traditional English pub in Little Britain. Fun fact: Up until 1963, St. Paul’s was London’s tallest building, standing 365 feet tall—one foot for each day of the year.\nEveryone is welcome, whether you're ready to get involved or just curious to learn more.\nAgenda\nWelcome drinks and snacks\nFind us downstairs in the pub, get social and settle in with snacks and drinks.\nIntroductions\nMeet your local Logos Circle leader and fellow participants. You’ll be invited to share a bit of your story — why you’re here and what draws you to this work.\nIntro to Logos & Cyber States\nA short talk from the Circle Leader: what is Logos, why are we building cyber states, and how this can drive real local change, followed by an open Q&A.\nSurfacing local issues\nA group discussion on local issues, emerging challenges, and active initiatives. Together we’ll explore where Logos tools and networks can support real-world action.\nNext steps & farewell\nWe’ll close with a clear roadmap: how you can stay involved, take action, and when we’ll gather again.\nAbout Logos \nLogos is the decentralised, privacy-preserving, neutral technology and movement for cyberstates and parallel societies. It powers peer-to-peer protocols for governance, storage, and messaging — foundations for network states and borderless institutions.\nAs a grassroots movement, Logos builds local communities to sustain the network in the spirit of the cypherpunks.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-c1DflirhA2J6JSY",
      "event_name": "Logos Circle London",
      "event_status": null,
      "event_timezone": "Europe/London",
      "event_type": null,
      "event_url": "https://luma.com/0eoq2jfu",
      "event_visibility": "public",
      "geo_latitude": 51.517035799999995,
      "geo_longitude": -0.0984034,
      "guest_count": 36,
      "host_name": null,
      "host_username": null,
      "location_city": "London",
      "location_country": "UK",
      "max_capacity": null,
      "start_at": "2025-10-08T16:30:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-09-17T11:47:12.289",
      "duration_minutes": null,
      "end_at": "2025-10-08T18:30:00",
      "event_description": "Benvinguts al Logos Circle Barcelona\nLa comunitat tecnològica i creativa de Barcelona és l’espai perfecte per explorar els network states (estats en xarxa) i generar impacte col·lectiu. Amb el suport d’AKASHA Hub, reunim cypherpunks, tecnòlegs, artistes, periodistes, activistes, entitats locals i líders comunitaris.\nCreem un espai regular per al diàleg, la col·laboració i l’acció sobre els temes clau de la comunitat.\nIdiomes: anglès, castellà, català\nAgenda\nBegudes & snacks – Benvinguda i encontre.\nPresentacions – Organitzadors i participants.\nLogos & Network States – Introducció + Q&A.\nQüestions locals – Reptes i iniciatives.\nPròxims passos – Full de ruta i cloenda.\nSobre Logos\nLogos és una tecnologia i moviment descentralitzat, neutral i respectuós amb la privacitat. Impulsa protocols peer-to-peer de governança, arxiu i missatgeria — base dels network states (estats en xarxa) i institucions sense fronteres.\nCom a moviment de base, Logos construeix comunitats locals que sostenen la xarxa en l’esperit dels cypherpunks.\nLlegeix el nostre manifest per saber-ne més. \n\n______ \nBienvenidos al Logos Circle Barcelona\nLa comunidad tecnológica y creativa de Barcelona es el lugar ideal para explorar los network states (estados en red) e impulsar un impacto colectivo. Con el apoyo de AKASHA Hub, reunimos a cypherpunks, tecnólogos, artistas, periodistas, activistas, organizaciones locales y líderes comunitarios.\nCreamos un espacio regularmente para el diálogo, la colaboración y la acción en torno a los temas que más nos importan.\nIdiomas: inglés, español, catalán\nAgenda\nBebidas & snacks – Bienvenida y encuentro.\nPresentaciones – Organizadores y participantes.\nLogos & Network States – Introducción + Q&A.\nTemas locales – Retos e iniciativas.\nPróximos pasos – Hoja de ruta y cierre.\nSobre Logos\nLogos es una tecnología y movimiento descentralizado, neutral y orientado a la privacidad. Impulsa protocolos peer-to-peer de gobernanza, archivo y mensajería — base de los network states (estados en red) y de instituciones sin fronteras.\nComo movimiento de base, Logos crea comunidades locales que sostienen la red en el espíritu de los cypherpunks.\nLee nuestro manifiesto para saber más.\n______\nWelcome to the Logos Circle Barcelona!\nBarcelona’s creative and tech community, rooted in its culture and history, is the perfect place to explore network states and drive collective impact. With support from AKASHA Hub, we gather cypherpunks, technologists, artists, journalists, activists, local charities and community leaders.\nJoin us to open a regular space for dialogue, collaboration, and action on the issues that matter most.\nLanguages: English, Spanish, Catalan\nAgenda\nDrinks & snacks – Meet and settle in.\nIntroductions – Organisers + participants share stories.\nLogos & Network States – Why we’re building them + Q&A.\nLocal issues – Group discussion on challenges & initiatives.\nNext steps – Roadmap and farewell.\nAbout Logos\nLogos is a decentralised, privacy-preserving, neutral technology and movement. It powers peer-to-peer protocols for governance, storage, and messaging — foundations for network states and borderless institutions.\nAs a grassroots movement, Logos builds local communities to sustain the network in the spirit of the cypherpunks.\nRead our manifesto to learn more.",
      "event_id": "evt-DdbsdlEDTp9STUL",
      "event_name": "Logos Circle Barcelona #2",
      "event_status": null,
      "event_timezone": "Europe/Madrid",
      "event_type": null,
      "event_url": "https://luma.com/p3h6my7f",
      "event_visibility": "public",
      "geo_latitude": 41.4109567,
      "geo_longitude": 2.1912024999999997,
      "guest_count": 69,
      "host_name": null,
      "host_username": null,
      "location_city": "Barcelona",
      "location_country": "Spain",
      "max_capacity": null,
      "start_at": "2025-10-08T16:30:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-09-04T13:58:49.132",
      "duration_minutes": null,
      "end_at": "2025-10-08T20:00:00",
      "event_description": "Bem-vindo à edição de outubro do Círculo Logos Lisboa!\nDesde a insegurança alimentar e os desafios da habitação até à autonomia digital e ao capitalismo de vigilância, acreditamos que a mudança real começa ao nível local. Este Circle é uma oportunidade para aprofundar ligações, dar seguimento às histórias levantadas no último encontro e dar as boas-vindas a novos membros.\nQuer já estejas pronto para te envolver ou apenas curioso para saber mais, és bem-vindo.\nAgenda\nChegada & Bebidas\nRecebe uma bebida e aproveita para conversar, fazer perguntas ou conhecer novas pessoas antes de começarmos.\nApresentações\nDamos início com uma recepção aos novos participantes e reintrodução do grupo. Será convidado a partilhar um pouco sobre o seu percurso e o que o/a trouxe até aqui.\nDiscussão em Círculo\nBreve resumo do último encontro e atualizações sobre as “histórias ganháveis” em curso\nConversa aberta sobre novas questões e ideias para possíveis iniciativas\nPartilha de competências e oportunidades de colaboração\nEncerramento\nPartilhamos os próximos passos, responsabilidades e relembramos que o Logos Circle se reúne na primeira quarta-feira de cada mês.\nSobre a Logos\nA Logos é uma stack tecnológica totalmente descentralizada, que preserva a privacidade e é politicamente neutra. A stack inclui três protocolos modulares e descentralizados: Nomos (consensus), Codex (storage) e Waku (mensagens). Juntos, oferecem a base técnica para cibersistemas, sociedades paralelas, network states ou qualquer instituição pública sem fronteiras baseada no consentimento voluntário.\nA Logos é também um conjunto de comunidades de aprendizagem que governarão e sustentarão a rede no espírito dos cypherpunks originais. Juntas, formam o movimento de base necessário para construir as instituições sociais, económicas e de governação que viverão sobre esta stack tecnológica.\nCom o tempo, estas instituições irão formar um mercado competitivo capaz de colmatar falhas na governação do mundo real, oferecendo serviços públicos resistentes à corrupção e baseados na confiança mínima, onde quer que a internet chegue.\nLê o nosso manifesto para mergulhar mais a fundo nos nossos ideais e tecnologia.\n\nWelcome to the October edition of the Logos Circle Lisbon!\nFrom food insecurity and housing struggles to digital autonomy and surveillance capitalism, we believe meaningful change begins at the local level. This Circle is a chance to deepen our connections, follow up on stories raised last time, and welcome new members into the conversation.\nWhether you’re ready to contribute or just curious to learn more, you’re invited.\nAgenda\nArrival & Beverages\nSettle in with a selection of drinks and take some time to reconnect, meet new people, or ask questions.\nIntroductions\nWe’ll kick off by welcoming new participants and reintroducing ourselves. You’ll be invited to share a little about your background and what brings you here.\nCircle Discussion\nQuick recap of last session and updates on active “winnable stories”\nGroup discussion on emerging issues and ideas for possible new initiatives\nOpen floor for skills-sharing and collaboration\nWrap-up\nWe’ll share next steps, responsibilities, and any volunteering opportunities that arise. We'll also share a reminder that the Logos Circle Lisbon meets on the first Wednesday of every month.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-JUAXqqGBgkCQNGQ",
      "event_name": "Logos Circle: Lisbon",
      "event_status": null,
      "event_timezone": "Europe/Lisbon",
      "event_type": null,
      "event_url": "https://luma.com/LCLisbon5",
      "event_visibility": "public",
      "geo_latitude": 38.71642430000001,
      "geo_longitude": -9.1384666,
      "guest_count": 113,
      "host_name": null,
      "host_username": null,
      "location_city": "Lisboa",
      "location_country": "Portugal",
      "max_capacity": null,
      "start_at": "2025-10-08T18:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-09-18T18:03:32.003",
      "duration_minutes": null,
      "end_at": "2025-10-09T02:00:00",
      "event_description": "¡Bienvenidos al primer Logos Circle en San José, Costa Rica!\nCosta Rica se posiciona como líder en innovación tecnológica y sostenibilidad en América Latina. Es el momento perfecto para explorar los network states (estados de red) e impulsar un impacto colectivo real desde nuestra región.\nLogos en colaboración con DecentralU y Dojo Coding se unen para reunir a cypherpunks, builders, tecnólogos, artistas, periodistas, activistas y líderes comunitarios para crear un espacio regular de diálogo, colaboración y acción sobre los temas que más nos importan.\n¿Te interesa la privacidad digital, la descentralización y construir el futuro de la web? Este es tu lugar.\n\nAgenda\nBebidas & snacks – Bienvenida y encuentro.\nPresentaciones – Organizadores y participantes.\nLogos & Network States – Introducción + Q&A.\nTemas locales – Retos e iniciativas.\nPróximos pasos – Hoja de ruta y cierre.\n\n¿Qué es Logos?\nLogos es una tecnología y movimiento completamente descentralizado, resistente a la censura, que preserva la privacidad y políticamente neutral.\nDesarrollamos protocolos descentralizados para:\nGovernance (Nomos) - Consenso privado y soberano\nStorage (Codex) - Almacenamiento resistente a la censura\nMessaging (Waku) - Comunicaciones privadas y escalables\nEstos forman la base tecnológica para network states, sociedades paralelas y instituciones sin fronteras basadas en el consentimiento voluntario.\nComo movimiento de base, Logos construye comunidades locales que sostienen la red en el espíritu de los cypherpunks originales.\nLee nuestro manifiesto para saber más →\n\nConoce a nuestros partners:\n¿Qué es DecentralU?\nDecentralU es una comunidad creada para impulsar carreras profesionales en Web3, con mentores que han estado allí y conexiones que abren puertas. Somos el HUB de oportunidades Web3: abrimos la puerta a quienes buscan algo mejor y quieren construir su futuro en este nuevo ecosistema.\n¿Qué es Dojo Coding?\nDojo Coding es la comunidad de developers más grande de LATAM. Conectamos talento con tecnologías emergentes como Web3 y AI, y actuamos como incubadora de proyectos para impulsar la próxima generación de builders innovadores.\n\n¿Quién debería asistir?\nDesarrolladores interesados en tecnologías emergentes\nTecnólogos que valoran la privacidad y descentralización\nEmprendedores explorando nuevos modelos de negocio\nActivistas trabajando en derechos digitales\nEstudiantes curiosos sobre el futuro de internet\nCualquier persona interesada en construir un futuro más libre y descentralizado\nNo se requiere experiencia previa.\nÚnete al Telegram oficial de Logos, si tienes preguntas hazlas en el canal San Jose-Circle",
      "event_id": "evt-7JSCswX9hP1mvsL",
      "event_name": "Logos Circles San José (Costa Rica) - Chapter 1",
      "event_status": null,
      "event_timezone": "America/Costa_Rica",
      "event_type": null,
      "event_url": "https://luma.com/hrvkzw6a",
      "event_visibility": "public",
      "geo_latitude": 9.939377499999999,
      "geo_longitude": -84.11404259999999,
      "guest_count": 35,
      "host_name": null,
      "host_username": null,
      "location_city": "San José",
      "location_country": "Costa Rica",
      "max_capacity": null,
      "start_at": "2025-10-08T23:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-09-17T10:16:34.503",
      "duration_minutes": null,
      "end_at": "2025-10-16T11:30:00",
      "event_description": "Welcome to the first Logos Circle gathering in Rome, taking place during Urbe Village!\nIn Part 1, we’ll open a discussion on key community issues — from housing and food insecurity to digital autonomy and surveillance capitalism.\nWe believe real change begins at the local level. Logos Circles are a global network of autonomous groups uniting people to strengthen their communities and create meaningful social impact.\nIn Part 2, you’ll take part in a hands-on workshop exploring Waku, the Logos peer-to-peer communications layer, followed by a presentation on Nomos, the peer-to-peer consensus layer.\nFollowing this amazing morning, we'll have a nice lunch all together next door.\n\nPart 1: 9:30 - 11:30am\nAgenda\nWelcome\nTake some time to meet the Logos core contributors, Circle organisers, and fellow participants.\nIntroductions\nSitting in a circle, each person shares a little about their story and why this work matters to them.\nIntroductions to Logos\nLearn about the Logos technology stack, the role of Circles, and why we organise in this way.\nTechnology and Winnable Issues\nHear stories from other Circles about how they have applied Logos technology to local challenges, and explore potential use cases for tackling winnable issues.\nStarting a Circle in Your City\nIf you feel inspired to launch a Circle where you live, we will share practical tips and next steps to help you get started.\n\nPart 2: 11:30am - 1:30pm\nWaku Workshop with Václav Pavlín :\n1. The Logos stack: Waku, Codex and Nomos\n2. Why do we build these tools\n3. Hands on Waku integration into a webapp\nPresentation by Shirly Valge on “The Importance of Private Proof of Stake in Facilitating Network States and Human Liberty.”\nLUNCH next door 1:30pm\n\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-ICNcBCglVRoRiKm",
      "event_name": "Logos Circle and Workshop in Rome - Urbe Village",
      "event_status": null,
      "event_timezone": "Europe/Rome",
      "event_type": null,
      "event_url": "https://luma.com/2qp19dva",
      "event_visibility": "public",
      "geo_latitude": 41.8743589,
      "geo_longitude": 12.472209099999999,
      "guest_count": 39,
      "host_name": null,
      "host_username": null,
      "location_city": "Roma",
      "location_country": "Italy",
      "max_capacity": null,
      "start_at": "2025-10-16T07:30:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-10-11T08:49:52.149",
      "duration_minutes": null,
      "end_at": "2025-10-16T12:00:00",
      "event_description": "Welcome to the first gathering of the Logos Circle doha!\nFrom housing and food insecurity to digital autonomy and surveillance capitalism, we believe real change starts at the local level. This first event is a chance to meet and connect with your peers, align on purpose, and begin laying the groundwork for projects that matter. Everyone is welcome, whether you're ready to get involved or just curious to learn more.\nAgenda:\n12:00 – 12:10 PM — Welcome Drinks & Opening Remarks\nWe’ll start the day with locally sourced snacks and refreshments as we settle in.\nKhadijah Amusat will officially open the session, introduce the Logos Circle Doha, and share the purpose and goals of today’s gathering.\n12:10 – 12:25 PM — Introductions\nMeet your local Logos Circle Admins and fellow participants. Everyone will be invited to briefly share their story, what drew them to Web3, and why this work resonates with them.\n12:25 – 12:45 PM — Understanding Logos Circles: Why We Organize This Way\nThis session explores the idea behind Logos Circles — decentralized local communities working toward shared goals. We’ll discuss how these circles contribute to the larger vision of building open, self-sovereign, and censorship-resistant systems.\n12:45 – 1:30 PM — Roundtable Discussion: Decentralized Privacy & Logos as a Cyber State\nAn open, interactive discussion moderated by Khadijah Amusat exploring digital privacy, data ownership, and the social implications of decentralized infrastructure.\nWe’ll also dive into Logos’ vision as a cyber-state and the role of Waku in enabling peer-to-peer communication, censorship resistance, and community coordination.\n1:30 – 2:25 PM — Community Onboarding & Local Initiatives\nA participatory session focused on hearing from everyone in the Circle.\nWe’ll discuss:\nLocal issues participants care about\nHow Logos’ tools and technologies can be applied to address real-world challenges in Doha and the region\nCollaborative ideas for future projects and community-driven action\nThis will be a key part of the session — giving everyone space to contribute, brainstorm, and co-create.\n2:25 – 2:45 PM — Next Steps & Upcoming Opportunities\nLearn how to get involved with the broader Logos community, join upcoming projects, and explore open bounties such as the RealFi Hackathon and Logos 8K challenge.\n2:45 – 3:00 PM — Farewell & Networking\nWe’ll wrap up with closing remarks, quick announcements, and casual networking over light refreshments.\nAbout logos\nLogos is a fully decentralized, privacy-preserving, and politically neutral technology stack.\nIt includes three modular protocols — Nomos (consensus), Codex (storage), and Waku (messaging) — forming the foundation for cyber states, network states, and digital-first public institutions based on voluntary participation.\nBeyond the tech, Logos is a movement  a federation of learning communities and builders dedicated to creating trust-minimized, transparent systems that can provide governance and public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology",
      "event_id": "evt-rWMeV1M9xhgfnqt",
      "event_name": "Logos Circles Doha",
      "event_status": null,
      "event_timezone": "Asia/Qatar",
      "event_type": null,
      "event_url": "https://luma.com/krtp52t8",
      "event_visibility": "public",
      "geo_latitude": 25.3253148,
      "geo_longitude": 51.4374435,
      "guest_count": 50,
      "host_name": null,
      "host_username": null,
      "location_city": "Ar Rayyan",
      "location_country": "Qatar",
      "max_capacity": null,
      "start_at": "2025-10-16T09:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-09-16T09:58:19.975",
      "duration_minutes": null,
      "end_at": "2025-10-17T18:00:00",
      "event_description": "Welcome to the first gathering of the Logos Circle in Cafe Holzmarktperle am Holzmarkt!\nFrom housing and food insecurity to digital autonomy and surveillance capitalism, we believe real change starts at the local level. This first event is a chance to meet and connect with your peers, align on purpose, and begin laying the groundwork for projects that matter. Everyone is welcome, whether you're ready to get involved or just curious to learn more.\nAgenda\nWelcome drinks and snacks\nEnjoy locally sourced snacks and drinks while we say hello and settle in.\nIntroductions\nGet to know your local Logos Circle Admins. You’ll be invited to share a bit about your story and why this work is meaningful to you.\nFocus on local issues\nA discussion about local initiatives already underway, emerging challenges, and how Logos can support through social action.\nFarewell!\nWe’ll share the roadmap for how you can get involved and when we’ll gather again.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-CDZws1z6iNXKRa8",
      "event_name": "Logos Circle Berlin: Meet • Align • Build - Launch night at Holzmarktperle",
      "event_status": null,
      "event_timezone": "Europe/Berlin",
      "event_type": null,
      "event_url": "https://luma.com/uqaz6gb4",
      "event_visibility": "public",
      "geo_latitude": 52.511429299999996,
      "geo_longitude": 13.426815699999999,
      "guest_count": 21,
      "host_name": null,
      "host_username": null,
      "location_city": "Berlin",
      "location_country": "Germany",
      "max_capacity": null,
      "start_at": "2025-10-17T16:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-10-14T13:42:16.734",
      "duration_minutes": null,
      "end_at": "2025-10-21T14:00:00",
      "event_description": "Welcome to the first gathering of the Logos Circle Nairobi! This Circle is happening in collaboration with Web3 Clubs, a developer community that aims to create builder capacity for Web3 product development.\nLogos Circles are self-organising local groups that strengthen civil society by addressing the needs of their communities.\nFrom housing and food insecurity to digital autonomy and surveillance capitalism, we believe real change starts at the local level. This first event is a chance to meet and connect with your peers, align on purpose, and begin laying the groundwork for projects that matter. Everyone is welcome, whether you're ready to get involved or just curious to learn more.\n\nAgenda\nWelcome drinks and snacks\nEnjoy locally sourced snacks and drinks while we say hello and settle in.\nIntroductions\nGet to know your local Logos Circle Admins. You’ll be invited to share a bit about your story and why this work is meaningful to you.\nIntroduction to Logos and Circles\nLearn about Logos — a movement to rebuild civil society through decentralised technologies and collective action. Discover how Logos Circles operate as self-organising local communities, working to strengthen civil society by addressing the unique needs of their regions.\nFocus on local issues\nA discussion about local initiatives already underway, emerging challenges, and how Logos can support through social action or technological solutions.\nFarewell!\nWe’ll share the roadmap for how you can get involved and when we’ll gather again.\n\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.\nAbout Web3 Clubs\nWeb3Clubs is a developer-focused community of Web3 developer clubs that aims to create capacity for Web3 product development in Eastern Africa. (@web3clubs on X.com)  We achieve this through our Web3 exploration Lab in Nairobi and by setting up autonomous Web3 developer clubs in universities and tech hubs. These clubs are portals to deliver Web3 awareness, technical skills and all-around mentorship in the space.",
      "event_id": "evt-gcAfnRrDOzbzlTZ",
      "event_name": "Logos Circle Nairobi",
      "event_status": null,
      "event_timezone": "Africa/Nairobi",
      "event_type": null,
      "event_url": "https://luma.com/eqtp8c2s",
      "event_visibility": "public",
      "geo_latitude": -1.2994603999999998,
      "geo_longitude": 36.781061099999995,
      "guest_count": 68,
      "host_name": null,
      "host_username": null,
      "location_city": "Nairobi",
      "location_country": "Kenya",
      "max_capacity": null,
      "start_at": "2025-10-21T12:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-10-14T12:48:36.17",
      "duration_minutes": null,
      "end_at": "2025-10-26T11:00:00",
      "event_description": "Welcome to the inaugural gathering of the Logos Circle Bishkek! We’re excited to host this special edition at ETH Bishkek.\nFrom housing and food insecurity to digital autonomy and surveillance capitalism, we believe real change starts at the local level. This first event is a chance to meet and connect with your peers, align on purpose, and begin laying the groundwork for projects that matter. Everyone is welcome, whether you're ready to get involved or just curious to learn more.\n\nAgenda\nWelcome drinks and snacks\nEnjoy locally sourced snacks and drinks while we say hello and settle in.\nIntroductions\nMeet your local Logos Circle Admins and fellow participants. You’ll have the chance to share a bit about your background, what brought you here, and why this mission resonates with you.\nIntroduction to Logos and Circles\nLearn about Logos — a movement to rebuild civil society through decentralised technologies and collective action. Discover how Logos Circles operate as self-organising local communities, working to strengthen civil society by addressing the unique needs of their regions.\nFocusing on Local Issues\nJoin a discussion on the key challenges and opportunities facing our community. We’ll explore local initiatives the Circle cares about, emerging issues, and ways Logos can offer support through collaborative social action.\nFarewell & Next Steps\nWe’ll wrap up by sharing the roadmap for getting involved, upcoming events, and when we’ll gather again.\nVsit https://www.ethbishkek.xyz/# to get tickets to the hackathon and attend the Circle.\n\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.\nAbout ETH Bishkek\nETH Bishkek is the first-ever Ethereum hackathon in Kyrgyzstan - a celebration of innovation, decentralisation, and community building in the heart of Central Asia. Our mission is to catalyse the local Web3 ecosystem, connect global builders with regional talent, and empower developers, designers, and dreamers to build meaningful blockchain-based solutions.",
      "event_id": "evt-HhOmnvK97IlO203",
      "event_name": "Logos Circle Bishkek",
      "event_status": null,
      "event_timezone": "Asia/Bishkek",
      "event_type": null,
      "event_url": "https://luma.com/7fttc48d",
      "event_visibility": "public",
      "geo_latitude": 42.8568066,
      "geo_longitude": 74.6347645,
      "guest_count": 0,
      "host_name": null,
      "host_username": null,
      "location_city": "Bishkek",
      "location_country": "Kyrgyzstan",
      "max_capacity": null,
      "start_at": "2025-10-26T03:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-10-16T23:45:19.728",
      "duration_minutes": null,
      "end_at": "2025-10-28T18:00:00",
      "event_description": "Welcome to the first gathering of the Logos Circle Ilorin !\nFrom housing and food insecurity to digital autonomy and surveillance capitalism, we believe real change starts at the local level. This first event is a chance to meet and connect with your peers, align on purpose, and begin laying the groundwork for projects that matter. Everyone is welcome, whether you're ready to get involved or just curious to learn more.\nAgenda\nWelcome drinks and snacks\nEnjoy locally sourced snacks and drinks while we say hello and settle in.\nIntroductions\nGet to know your local Logos Circle Admins. You’ll be invited to share a bit about your story and why this work is meaningful to you.\nFocus on local issues\nA discussion about local initiatives already underway, emerging challenges, and how Logos can support through social action.\nFarewell!\nWe’ll share the roadmap for how you can get involved and when we’ll gather again.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-IX70qp5wD0VmGOD",
      "event_name": "Logos Circle Ilorin Premiere",
      "event_status": null,
      "event_timezone": "Africa/Lagos",
      "event_type": null,
      "event_url": "https://luma.com/jodixq15",
      "event_visibility": "public",
      "geo_latitude": null,
      "geo_longitude": null,
      "guest_count": 38,
      "host_name": null,
      "host_username": null,
      "location_city": null,
      "location_country": null,
      "max_capacity": null,
      "start_at": "2025-10-28T16:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-10-27T18:39:56.707",
      "duration_minutes": null,
      "end_at": "2025-10-29T16:00:00",
      "event_description": "We’ll have coffee while discussing Logos’ grassroots activism and our collective effort to remedy institutional This meeting is designed to seed potential leaders who may want to start their own Circle in their community, focused on addressing a winnable issue—a local, specific, and solvable problem that truly matters.\nWhat is a Logos Circle?\nLogos Circles are self-organizing local groups that strengthen civil society by tackling the needs of their communities. They are a practical way to put decentralized, values-driven action into motion.\nDuring the meeting, we will provide an overview of the Logos organization and movement, followed by a deeper dive into the Logos Circle network, including how it works, what leadership entails, and ways to get involved.\nFor those curious ahead of time, here are a few helpful links:\nLogos Circles\nLogos\nIt’s important to note that Logos is not only building a sovereign technology stack for cyberstates, but is also a principle-first, cypherpunk community. We are as committed to building strong, resilient communities through grassroots activism and hands-on effort as we are to developing secure protocols backed by robust encryption.\nThis Circle session is a special edition happening during Edge City Patagonia, offering a unique opportunity to connect, learn, and explore leadership within the global Logos network.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.\nAbout Edge City\nEdge City is a society incubator dedicated to advancing human flourishing.\n‍\nWe host monthlong popup villages where people at the frontiers of technology, science, and culture live and work together. Each village is an environment for running real experiments on new ideas and collaborations.\n\nOur driving belief is that breakthroughs happen when curious, kind, and high-agency people share space and momentum.",
      "event_id": "evt-mgE1UJSku13Dshj",
      "event_name": "Logos Circle: Edge City Patagonia",
      "event_status": null,
      "event_timezone": "America/Argentina/Salta",
      "event_type": null,
      "event_url": "https://luma.com/08s8smf6",
      "event_visibility": "public",
      "geo_latitude": -40.155409,
      "geo_longitude": -71.35149419999999,
      "guest_count": 11,
      "host_name": null,
      "host_username": null,
      "location_city": "San Martín de los Andes",
      "location_country": "Argentina",
      "max_capacity": null,
      "start_at": "2025-10-29T14:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-10-14T23:25:05.748",
      "duration_minutes": null,
      "end_at": "2025-10-31T05:00:00",
      "event_description": "What Are Logos Circles?\nLogos Circles are regular meetups held in various hubs around the world and in cyberspace, aimed at expanding the Logos community and identifying issues that Logos technologies and grassroots collective action can address.\n\nIf you are new to Logos and interested in participating in the Los Angeles Circle then we would love to meet you!\n\n Logos is a sovereign, decentralized technology stack that realizes the cypherpunk vision of autonomous digital territories and network states. It is designed to champion personal liberties and collective abundance through upgrading human governance.\nhttps://logos.co\nhttps://logos.co/manifesto\nhttps://circles.logos.co",
      "event_id": "evt-2E2UNisjubssZAv",
      "event_name": "Logos Circle: Los Angeles",
      "event_status": null,
      "event_timezone": "America/Los_Angeles",
      "event_type": null,
      "event_url": "https://luma.com/m9ulp616",
      "event_visibility": "public",
      "geo_latitude": 34.044711299999996,
      "geo_longitude": -118.2352851,
      "guest_count": 27,
      "host_name": null,
      "host_username": null,
      "location_city": "Los Angeles",
      "location_country": "USA",
      "max_capacity": null,
      "start_at": "2025-10-31T02:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-10-14T13:13:58.398",
      "duration_minutes": null,
      "end_at": "2025-11-05T21:00:00",
      "event_description": "Welcome to the upcoming gathering of the Logos Circle Lisbon! This special edition marks not only our next community meeting but also the kick-off of Rare Effect.\nFrom 6th to 9th November, at Rare Effect Festival, the Quinta do Mocho community will showcase the progress of their ongoing film project, an initiative the Logos Circle has been supporting. The film captures the life, struggles, and creative talent of the community, illustrating the power of grassroots organising when traditional systems fall short.\nLogos Circles are self-organising local groups that strengthen civil society by addressing the needs of their communities. From food insecurity and housing struggles to digital autonomy and surveillance capitalism, we believe meaningful change begins at the local level. This Circle is a chance to deepen our connections, follow up on stories raised last time, and welcome new members into the conversation.\nWhether you’re ready to contribute or just curious to learn more, you’re invited.\n\nAgenda\nArrival & Beverages\nSettle in with a selection of drinks and take some time to reconnect, meet new people, or ask questions.\nIntroductions\nWe’ll kick off by welcoming new participants and reintroducing ourselves. You’ll be invited to share a little about your background and what brings you here.\nCircle Discussion\nQuick recap of last session and updates on active “winnable stories”\nGroup discussion on emerging issues and ideas for possible new initiatives\nOpen floor for skills-sharing and collaboration\nWords from Rare Effect\nRare Effect founders will introduce the themes of this year's festival and what guests can expect.\nWrap-up\nWe’ll share next steps, next time we’ll meet, responsibilities, and any volunteering opportunities that arise.\n\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.\nAbout Rare Effect\nRare Effect returned for its 6th edition from 6-9th November at Arroz Estúdios and Well Read.\nThe festival format changes this year to take place over 3 days, across 2 venues, offering digital art exhibitions, music, workshops, and artist residencies, encouraging active audience participation and expanding access to and knowledge of digital art and new forms of artistic expression.\nThe programme is presented in partnership with Reset! network, Well Read, Gerador, and Parallel Society.",
      "event_id": "evt-EQxRuG3GPb9BYEa",
      "event_name": "Logos Circle Lisbon",
      "event_status": null,
      "event_timezone": "Europe/Lisbon",
      "event_type": null,
      "event_url": "https://luma.com/axwejqse",
      "event_visibility": "public",
      "geo_latitude": 38.71642430000001,
      "geo_longitude": -9.1384666,
      "guest_count": 124,
      "host_name": null,
      "host_username": null,
      "location_city": "Lisboa",
      "location_country": "Portugal",
      "max_capacity": null,
      "start_at": "2025-11-05T19:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-10-21T11:02:42.233",
      "duration_minutes": null,
      "end_at": "2025-11-06T19:30:00",
      "event_description": "Benvinguts al Logos Circle Barcelona #3\nLa comunitat tecnològica i creativa de Barcelona és l’espai perfecte per explorar els network states (estats en xarxa) i generar impacte col·lectiu. Amb el suport d’AKASHA Hub, reunim cypherpunks, tecnòlegs, artistes, periodistes, activistes, entitats locals i líders comunitaris.\nCreem un espai regular per al diàleg, la col·laboració i l’acció sobre els temes clau de la comunitat.\nIdiomes: anglès, castellà, català\nAgenda\nBegudes & pizza – Benvinguda i encontre.\nPresentacions – Organitzadors i participants.\nLogos & Network States – Introducció + Q&A.\nQüestions locals – Reptes i iniciatives.\nPròxims passos – Full de ruta i cloenda.\nI aquest cop… farem un giveaway d’1 entrada per al Mozilla Festival 2025 🎟️ entre els assistents!\nSobre Logos\nLogos és una tecnologia i moviment descentralitzat, neutral i respectuós amb la privacitat. Impulsa protocols peer-to-peer de governança, arxiu i missatgeria — base dels network states (estats en xarxa) i institucions sense fronteres.\nCom a moviment de base, Logos construeix comunitats locals que sostenen la xarxa en l’esperit dels cypherpunks.\nLlegeix el nostre manifest per saber-ne més. \n\n______ \nBienvenidos al Logos Circle Barcelona #3\nLa comunidad tecnológica y creativa de Barcelona es el lugar ideal para explorar los network states (estados en red) e impulsar un impacto colectivo. Con el apoyo de AKASHA Hub, reunimos a cypherpunks, tecnólogos, artistas, periodistas, activistas, organizaciones locales y líderes comunitarios.\nCreamos un espacio regularmente para el diálogo, la colaboración y la acción en torno a los temas que más nos importan.\nIdiomas: inglés, español, catalán\nAgenda\nBebidas & pizza – Bienvenida y encuentro.\nPresentaciones – Organizadores y participantes.\nLogos & Network States – Introducción + Q&A.\nTemas locales – Retos e iniciativas.\nPróximos pasos – Hoja de ruta y cierre.\nAdemás, sortearemos 1 entrada para el Mozilla Festival 2025 🎟️ entre los asistentes.\nSobre Logos\nLogos es una tecnología y movimiento descentralizado, neutral y orientado a la privacidad. Impulsa protocolos peer-to-peer de gobernanza, archivo y mensajería — base de los network states (estados en red) y de instituciones sin fronteras.\nComo movimiento de base, Logos crea comunidades locales que sostienen la red en el espíritu de los cypherpunks.\nLee nuestro manifiesto para saber más.\n______\nWelcome to the Logos Circle Barcelona #3!\nBarcelona’s creative and tech community, rooted in its culture and history, is the perfect place to explore network states and drive collective impact. With support from AKASHA Hub, we gather cypherpunks, technologists, artists, journalists, activists, local charities and community leaders.\nJoin us to open a regular space for dialogue, collaboration, and action on the issues that matter most.\nLanguages: English, Spanish, Catalan\nAgenda\nDrinks & pizza – Meet and settle in.\nIntroductions – Organisers + participants share stories.\nLogos & Network States – Why we’re building them + Q&A.\nLocal issues – Group discussion on challenges & initiatives.\nNext steps – Roadmap and farewell.\nWe’ll also be giving away 1 ticket to Mozilla Festival 2025 🎟️ during the event!\nAbout Logos\nLogos is a decentralised, privacy-preserving, neutral technology and movement. It powers peer-to-peer protocols for governance, storage, and messaging — foundations for network states and borderless institutions.\nAs a grassroots movement, Logos builds local communities to sustain the network in the spirit of the cypherpunks.\nRead our manifesto to learn more.",
      "event_id": "evt-rtAIjl2nNzjd9AA",
      "event_name": "Logos Circle Barcelona #3",
      "event_status": null,
      "event_timezone": "Europe/Madrid",
      "event_type": null,
      "event_url": "https://luma.com/qf2d3ao0",
      "event_visibility": "public",
      "geo_latitude": 41.4109567,
      "geo_longitude": 2.1912024999999997,
      "guest_count": 80,
      "host_name": null,
      "host_username": null,
      "location_city": "Barcelona",
      "location_country": "Spain",
      "max_capacity": null,
      "start_at": "2025-11-06T17:30:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-09-17T19:34:25.529",
      "duration_minutes": null,
      "end_at": "2025-11-07T02:00:00",
      "event_description": "¡Bienvenidos al primer encuentro del Círculo Logos Ciudad de México!\nDesde la vivienda y la inseguridad alimentaria hasta la autonomía digital y el capitalismo vigilante, creemos que el cambio real comienza a nivel local.\nEste primer evento es una oportunidad para conocer y conectar con tus pares, alinearse en el propósito, y comenzar a sentar las bases para proyectos que impacten.\nTodos son bienvenidos, ya sea que estés listo para involucrarte o simplemente tengas curiosidad por aprender más.\nAgenda\nBebidas y aperitivos de bienvenida\nDisfruta de aperitivos y bebidas mientras nos saludamos y nos acomodamos.\nPresentaciones\nConoce a los Administradores de tu Círculo Logos CdMx.\nTe invitaremos a compartir un poco sobre tu historia y por qué esto es significativo para ti.\nEnfoque en temas locales\nUna discusión sobre iniciativas locales ya en marcha, desafíos emergentes, y cómo Logos puede apoyar a través de la acción social.\n¡Hasta la próxima!\nCompartiremos la hoja de ruta sobre cómo puedes involucrarte y cuándo nos reuniremos nuevamente.\nAcerca de Logos\nLogos es un stack tecnológico completamente descentralizado que preserva la privacidad y es políticamente neutral. El stack tecnológico incluye tres protocolos modulares y descentralizados: Nomos (consenso), Codex (almacenamiento), y Waku (mensajería). Combinados, proporcionan la base técnica para los ciber-estados, las sociedades paralelas, los estados-red, o cualquier institución pública sin fronteras basada en el consentimiento voluntario.\nLogos es también una colección de comunidades de aprendizaje que gobernarán y sostendrán la red, en el espíritu de los cypherpunks originales. Juntos, forman el movimiento de base necesario para construir las instituciones sociales, económicas y de gobernanza que vivirán en el stack tecnológico.\nEventualmente, estas instituciones poblarán un mercado competitivo que puede llenar los vacíos en la gobernanza del mundo actual, proporcionando servicios públicos con mínima dependencia de confianza y resistentes a la corrupción dondequiera que el internet pueda llegar.\nLee nuestro Manifesto para profundizar en nuestros ideales y tecnología.",
      "event_id": "evt-xA5FVfHxSRbpqYX",
      "event_name": "Reunión de Arranque del Círculo Logos en CdMx",
      "event_status": null,
      "event_timezone": "America/Mexico_City",
      "event_type": null,
      "event_url": "https://luma.com/91w012ij",
      "event_visibility": "public",
      "geo_latitude": 19.371344999999998,
      "geo_longitude": -99.1822052,
      "guest_count": 21,
      "host_name": null,
      "host_username": null,
      "location_city": "Ciudad de México",
      "location_country": "Mexico",
      "max_capacity": null,
      "start_at": "2025-11-06T23:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-11-05T09:47:36.161",
      "duration_minutes": null,
      "end_at": "2025-11-08T15:00:00",
      "event_description": "Welcome to the second Logos Circle in Benin, Nigeria!\nThis gathering is part of a growing network of Logos Circles around the world that explore how decentralised tools, local knowledge, and collective action can help solve real-world issues from the ground up.\nFor this second Benin Circle, we’ll use the Helena Food in The University of Benin space to connect, share experiences, and begin mapping out how Logos Circles in Nigeria can address pressing local challenges through community-driven solutions.\nEveryone is welcome—whether you’re already engaged in grassroots initiatives, experimenting with decentralised tools, or simply curious to learn and contribute.\nAgenda\nWhat is Logos & What Are Circles?\nAn introduction to Logos: the technology stack, the network state vision, and how Circles serve as entry points for local action.\nBenin in Focus\nAn open discussion on the opportunities and challenges facing communities in Benin City today. How can local knowledge, skills, and networks combine with decentralised tools to make a difference?\nSkills Exchange + Group Dialogue\nA chance to get to know each other better—what experience, talents, or perspectives do we each bring? Where could collaboration emerge?\nWrap Up + What’s Next\nOutlining possible next steps for the Benin Circle and inviting participants to stay connected as the local network grows.\nAbout Logos\nLogos is a sovereign, decentralised technology stack that realises the cypherpunk vision of autonomous digital territories and network states. It is designed to champion personal liberties and collective abundance through upgrading human governance.",
      "event_id": "evt-hE7sEckzF2DkcQ0",
      "event_name": "Logos Circle: Benin",
      "event_status": null,
      "event_timezone": "Africa/Lagos",
      "event_type": null,
      "event_url": "https://luma.com/05or77xs",
      "event_visibility": "public",
      "geo_latitude": 6.399878999999999,
      "geo_longitude": 5.608990599999999,
      "guest_count": 29,
      "host_name": null,
      "host_username": null,
      "location_city": "Benin City",
      "location_country": "Nigeria",
      "max_capacity": null,
      "start_at": "2025-11-08T13:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-11-07T17:10:08.076",
      "duration_minutes": null,
      "end_at": "2025-11-17T21:00:00",
      "event_description": "Welcome to the Logos Circle London chapter!\nWe believe real change starts at the local level. This is a chance to meet and connect with your peers, align on purpose, and begin laying the groundwork for projects that matter.\nJoin us in the heart of the City at The Vintry EC4, steps from the Monument to the Great Fire of London. Fun fact: This 202-foot Doric column, crowned by a gilded flame, exactly 202 feet west of where the 1666 fire started, stands as tribute to London's unbreakable spirit, honouring the city's phoenix-like rebirth and rapid reconstruction into a grander metropolis.\nEveryone is welcome, whether you're ready to get involved or just curious to learn more.\nAgenda\nWelcome drinks and snacks\nFind us downstairs in the pub, get social and settle in with snacks and drinks.\nIntroductions\nMeet your local Logos Circle leader and fellow participants. You’ll be invited to share a bit of your story — why you’re here and what draws you to this work.\nIntro to Logos & Cyber States\nA short talk from the Circle Leader: what is Logos, why are we building cyber states, and how this can drive real local change, followed by an open Q&A.\nSurfacing local issues\nA group discussion on local issues, emerging challenges, and active initiatives. Together we’ll explore where Logos tools and networks can support real-world action.\nNext steps & farewell\nWe’ll close with a clear roadmap: how you can stay involved, take action, and when we’ll gather again.\n\nAbout Logos\nLogos is the sovereign digital infrastructure that enables parallel trans-national societies at scale. We build privacy-preserving networks that are resilient against hostile adversaries, uphold civil liberties through competitive legitimate governance, and serve as the foundation for new social and economic structures in cyberspace.\nAs a grassroots movement, Logos builds local communities to sustain the network in the spirit of the cypherpunks.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-QzviErmYuqQu9ub",
      "event_name": "Logos Circle London",
      "event_status": null,
      "event_timezone": "Europe/London",
      "event_type": null,
      "event_url": "https://luma.com/g18ci6ji",
      "event_visibility": "public",
      "geo_latitude": 51.511534,
      "geo_longitude": -0.08853319999999999,
      "guest_count": 81,
      "host_name": null,
      "host_username": null,
      "location_city": "London",
      "location_country": "UK",
      "max_capacity": null,
      "start_at": "2025-11-17T18:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-11-03T14:40:07.333",
      "duration_minutes": null,
      "end_at": "2025-11-19T15:00:00",
      "event_description": "Welcome to a special edition of the Logos Circle Buenos Aires happening at Funding the Commons Buenos Aires!\nWe’ll open a discussion on key community issues — from housing and food insecurity to digital autonomy and surveillance capitalism.\nWe believe real change begins at the local level. Logos Circles are a global network of autonomous groups uniting people to strengthen their communities and create meaningful social impact.\n\nAgenda\nWelcome\nTake some time to meet the Logos core contributors, Circle organisers, and fellow participants.\nIntroductions\nSitting in a circle, each person shares a little about their story and why this work matters to them.\nIntroductions to Logos\nLearn about the Logos technology stack, the role of Circles, and why we organise in this way.\nTechnology and Winnable Issues\nHear stories from other Circles about how they have applied Logos technology to local challenges, and explore potential use cases for tackling winnable issues.\nStarting a Circle in Your City\nIf you feel inspired to launch a Circle where you live, we will share practical tips and next steps to help you get started.\n\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.\n\nAbout Funding the Commons Buenos Aires\nAt Funding the Commons: Buenos Aires, we’ll explore problems that matter to everyday life—how to send money across borders, coordinate shared treasuries, participate in governance, verify identity with privacy, build open AI for the public good, and protect shared environmental resources. Hosting the event during DevConnect is a chance to connect these challenges with global builders.",
      "event_id": "evt-xZR3utE9XttfsKD",
      "event_name": "Logos Circle Buenos Aires",
      "event_status": null,
      "event_timezone": "America/Buenos_Aires",
      "event_type": null,
      "event_url": "https://luma.com/n3qlcuap",
      "event_visibility": "public",
      "geo_latitude": -34.5958581,
      "geo_longitude": -58.38786940000001,
      "guest_count": 40,
      "host_name": null,
      "host_username": null,
      "location_city": "Buenos Aires",
      "location_country": "Argentina",
      "max_capacity": null,
      "start_at": "2025-11-19T13:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-11-13T20:40:28.799",
      "duration_minutes": null,
      "end_at": "2025-11-20T23:00:00",
      "event_description": "Circles Latam – Primer Círculo en Buenos Aires\n\n¡Bienvenidos al primer Circulo de Logos en Buenos Aires!\nEn el marco de Devconnect, inauguramos oficialmente la llegada de Circles a Latinoamérica. Buenos Aires se convierte así en la ciudad #22 del movimiento, impulsada por una comunidad diversa, curiosa y comprometida, lista para explorar y ejercer el 5to poder bajo la ciudadanía digital.\nEl mundo enfrenta problemas de acceso a la vivienda, calidad educativa, alimentación, acceso al financiamiento, identidad y autonomía digital.\nDentro del Círculo creemos que el cambio real empieza a nivel local: este primer encuentro es una oportunidad para conocernos, alinearnos y empezar a construir la base de proyectos que realmente importan.\nTodos son bienvenidos: quienes quieran involucrarse activamente, quienes vienen a explorar o quienes simplemente sienten curiosidad por como funciona Circles.\n\nAgenda\nBienvenida\nMientras nos acomodamos y presentamos vamos a compartir unos tragos y algo rico para comer.\nIntroducción\nLos organizadores nos vamos a presentar y los vamos a invitar a que compartan brevemente su historia, su interés en Circles y cómo les gustaría ver crecer en la región.\nCircles en el contexto local\nConversamos sobre iniciativas locales, desafíos emergentes, mecanismos de reputación y coordinación, y cómo Circles puede apoyar distintos proyectos sociales, instituciones y organizaciones.\nCómo involucrarse y próximos pasos\nCerramos compartiendo el roadmap, oportunidades para participar, y cuándo volveremos a reunirnos.\n\nSobre Circles y Logos\nCircles es un experimento que comenzó en el año 2024 y se viene llevando a cabo en 21 ciudades alrededor del mundo. Es un espacio en el que convergen activistas, empresarios, emprendedores, inversores, artistas, políticos y periodistas que buscan explorar formas de identidad colaborativa y una nueva reputación humana para resolver problemas que importan a la ciudadania de manera directa.\nSu misión es abrir caminos hacia modelos de confianza y participación más humanos, colaborativos y descentralizados.\nLogos, por su parte, es un stack tecnológico totalmente descentralizado, privado y políticamente neutral.\nEl stack incluye tres protocolos modulares:\nλ Blockchain\nλ Storage\nλ Messaging\nCombinados ofrecen los cimientos tecnológicos para la creación de nuevas formas de gobierno: ciberestados, sociedades paralelas, instituciones digitales sin fronteras basadas en el consentimiento voluntario.\nLogos también es una red de comunidades de aprendizaje que sostienen y gobiernan el ecosistema, al estilo del espíritu cypherpunk original.\nLogos y Circles forman el movimiento de base que necesitamos para construir nuevas instituciones sociales, económicas y de gobernanza que funcionen sobre esta tecnología.\nCon el tiempo, estas instituciones van a crear un mercado más competitivo, capaz de cubrir los vacíos de gobernanza que existen en el mundo real, ofreciendo servicios públicos con mínima necesidad de confianza y resistentes a la corrupción, en cualquier lugar donde llegue internet.\nSi querés profundizar más en nuestra tecnología e ideales, podés explorar el Logos Manifesto.",
      "event_id": "evt-AviDfWAbPMhRspn",
      "event_name": "Kick off - Logos Circle edición BA",
      "event_status": null,
      "event_timezone": "America/Buenos_Aires",
      "event_type": null,
      "event_url": "https://luma.com/circleBA",
      "event_visibility": "public",
      "geo_latitude": -34.5961172,
      "geo_longitude": -58.3732859,
      "guest_count": 37,
      "host_name": null,
      "host_username": null,
      "location_city": "AAC",
      "location_country": "Argentina",
      "max_capacity": null,
      "start_at": "2025-11-20T21:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-11-20T23:29:29.696",
      "duration_minutes": null,
      "end_at": "2025-11-26T01:00:00",
      "event_description": "Get started with Logos at https://logos.co \nGet a head start and check out the Logos Forum\nWe are exploring what comes next: network states, parallel institutions, and technology that puts power back in the hands of communities.\nWhat to Expect\nIntroduction to Logos\nA primer on the movement:\nFrom Bitcoin to Ethereum to Logos: the evolution of the cypherpunk dream\nHow privacy-preserving tech (Messaging, Storage, Blockchain) enables parallel societies\nReal examples from Logos Circles in Brno, London, and beyond\nOpen Q&A: Bring your toughest questions.\nLocal Focus: What Issues Matter Here?\nCollaborative discussion on challenges facing the Claremont community and beyond:\nWhere are current institutions failing students and communities?\nWhat problems could decentralized tools actually solve?\nHow might we deploy Logos technologies for real local impact?\nThis isn't theoretical it's about identifying concrete projects we can build together.\nThe Logos Tech Stack: Tools for Freedom\nDiscover the privacy-first, censorship-resistant infrastructure being built:\nLogos Messaging anonymous peer-to-peer messaging\nLogos Storage decentralized, durable storage\nLogos Blockchain privacy-preserving consensus\nLearn how these protocols enable everything from whistleblower platforms to community governance systems to alternatives to surveillance capitalism.\nWhat's Next: Building Our Circle\nLeave with clear pathways to stay involved:\nRoles and working groups forming\nUpcoming events and learning opportunities\nHow to contribute (no coding required)\nSwag, Resources & Community Access\nTake home Logos zines and stickers. Get onboarded to our forum and Discord where the real work happens.\nWhy This Matters\nWe're part of a generation that grew up watching institutions fail us: financial crashes, surveillance capitalism, broken governance, climate inaction, and the erosion of digital privacy. We don't need permission to build alternatives.\nLogos is a peaceful resistance movement a continuation of the original cypherpunk vision that strong cryptography and decentralized technology can route around broken systems and restore individual sovereignty.\nThis Circle is your on-ramp to:\nLearn about network states, parallel societies, and post-nation governance\nConnect with mission-aligned students and builders\nBuild real solutions to local problems using cutting-edge decentralized tech\nJoin a global movement reimagining how humans organize and govern\nWho Should Come?\n✨ Political theory nerds curious about alternatives to the nation-state\n✨ Privacy advocates and cypherpunk enthusiasts\n✨ Developers wanting to build for human freedom\n✨ Activists looking for corruption-resistant organizing tools\n✨ Anyone fed up with big tech, big government, and big banks\n✨ The simply curious no prerequisite knowledge needed\nAbout Logos\nLogos is both a technology stack and a social movement building infrastructure for self-sovereign network states.\nWe're creating the tools for parallel societies: privacy-preserving communications, censorship-resistant storage, and decentralized consensus all politically neutral, fully open-source, and designed to restore agency to individuals and communities.\nOur Mission: Upgrade human governance by giving people ownership over the technologies and institutions that shape their lives.\nRead the full vision: Logos Manifesto\nRead Farewell to Westphalia: Book Link\nIf you believe the future shouldn't be determined by decaying bureaucracies and surveillance states...\nIf you're ready to explore how technology can enable new forms of voluntary cooperation and self-governance...\nIf you want to connect with others building toward a more free, private, and human-centric world...\nJoin us.\nCircles are the local nodes of a global movement. Let's activate ours.",
      "event_id": "evt-opiKEOYVmxBRbZb",
      "event_name": "Logos Circle: Claremont",
      "event_status": null,
      "event_timezone": "America/Los_Angeles",
      "event_type": null,
      "event_url": "https://luma.com/5pe9bhss",
      "event_visibility": "public",
      "geo_latitude": 34.109472499999995,
      "geo_longitude": -117.7021065,
      "guest_count": 4,
      "host_name": null,
      "host_username": null,
      "location_city": "Claremont",
      "location_country": "USA",
      "max_capacity": null,
      "start_at": "2025-11-25T23:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-10-29T14:17:41.181",
      "duration_minutes": null,
      "end_at": "2025-11-28T19:30:00",
      "event_description": "Welcome to the second gathering of the Logos Circle in Cafe Holzmarktperle am Holzmarkt!\nFrom housing and food insecurity to digital autonomy and surveillance capitalism, we believe real change starts at the local level. This first event is a chance to meet and connect with your peers, align on purpose, and begin laying the groundwork for projects that matter. Everyone is welcome, whether you're ready to get involved or just curious to learn more.\nAgenda\nWelcome drinks and snacks\nEnjoy locally sourced snacks and drinks while we say hello and settle in.\nIntroductions\nGet to know your local Logos Circle Admins. You’ll be invited to share a bit about your story and why this work is meaningful to you.\nFocus on local issues\nA discussion about local initiatives already underway, emerging challenges, and how Logos can support through social action.\nFarewell!\nWe’ll share the roadmap for how you can get involved and when we’ll gather again.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-QhzizBFJ6LmBM4p",
      "event_name": "Logos Circle Berlin: Meet • Align • Build - Launch night at Holzmarktperle",
      "event_status": null,
      "event_timezone": "Europe/Berlin",
      "event_type": null,
      "event_url": "https://luma.com/42b0kx2c",
      "event_visibility": "public",
      "geo_latitude": 52.511429299999996,
      "geo_longitude": 13.426815699999999,
      "guest_count": 17,
      "host_name": null,
      "host_username": null,
      "location_city": "Berlin",
      "location_country": "Germany",
      "max_capacity": null,
      "start_at": "2025-11-28T17:30:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-11-19T10:15:15.931",
      "duration_minutes": null,
      "end_at": "2025-11-30T13:30:00",
      "event_description": "The Peace of Westphalia (1648) established the nation-state to stop Europeans from killing each other over religion. Today, that same system is the primary engine of global conflict, financial censorship, and local decay.\nWhy are we using 17th-century technology to run 21st-century lives?\nThe state has failed to protect our privacy, failed to preserve our wealth, and failed to represent our local interests. But for the first time in history, we have the tools to build something better. We don't need a revolution of blood; we need a revolution of code.\nWe are hosting a small, high-signal meetup to discuss how Blockchain Governance can replace the rotting infrastructure of the state, starting right here in our neighborhood.",
      "event_id": "evt-38ZTkcHTXgJ3xjU",
      "event_name": "Logos Bengaluru Circle",
      "event_status": null,
      "event_timezone": "Asia/Calcutta",
      "event_type": null,
      "event_url": "https://luma.com/854p3l0v",
      "event_visibility": "public",
      "geo_latitude": null,
      "geo_longitude": null,
      "guest_count": 9,
      "host_name": null,
      "host_username": null,
      "location_city": null,
      "location_country": null,
      "max_capacity": null,
      "start_at": "2025-11-30T11:30:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-11-21T00:36:25.571",
      "duration_minutes": null,
      "end_at": "2025-12-03T05:00:00",
      "event_description": "Logos Circle: Los Angeles - Event Description\nGet started with Logos at https://logos.co  \n\nGet a head start and check out the Logos Forum https://forum.logos.co.\nWe are exploring what comes next: network states, parallel institutions, and technology that puts power back in the hands of communities.\nWhat to Expect\nIntroduction to Logos\nA primer on the movement:\nFrom Bitcoin to Ethereum to Logos: the evolution of the cypherpunk dream\nHow privacy-preserving tech (Messaging, Storage, Blockchain) enables parallel societies\nReal examples from Logos Circles in Brno, London, and beyond\nOpen Q&A: Bring your toughest questions.\nLocal Focus: What Issues Matter Here?\nCollaborative discussion on challenges facing the Los Angeles community:\nWhere are current institutions failing our communities?\nWhat problems could decentralized tools actually solve?\nHow might we deploy Logos technologies for real local impact?\nThis isn't theoretical—it's about identifying concrete projects we can build together.\nThe Logos Tech Stack: Tools for Freedom\nDiscover the privacy-first, censorship-resistant infrastructure being built:\nLogos Messaging—anonymous peer-to-peer messaging\nLogos Storage—decentralized, durable storage\nLogos Blockchain—privacy-preserving consensus\nLearn how these protocols enable everything from whistleblower platforms to community governance systems to alternatives to surveillance capitalism.\nWhat's Next: Building Our Circle\nLeave with clear pathways to stay involved:\nRoles and working groups forming\nUpcoming events and learning opportunities\nHow to contribute (no coding required)\nSwag, Resources & Community Access\nTake home Logos zines and stickers. Get onboarded to our forum and Discord where the real work happens.\nWhy This Matters\nWe're part of a generation that grew up watching institutions fail us: financial crashes, surveillance capitalism, broken governance, climate inaction, and the erosion of digital privacy. We don't need permission to build alternatives.\nLogos is a peaceful resistance movement—a continuation of the original cypherpunk vision that strong cryptography and decentralized technology can route around broken systems and restore individual sovereignty.\nThis Circle is your on-ramp to:\nLearn about network states, parallel societies, and post-nation governance\nConnect with mission-aligned builders and forward-thinkers\nBuild real solutions to local problems using cutting-edge decentralized tech\nJoin a global movement reimagining how humans organize and govern\nWho Should Come?\n✨ Political theory nerds curious about alternatives to the nation-state✨ Privacy advocates and cypherpunk enthusiasts✨ Developers wanting to build for human freedom✨ Activists looking for corruption-resistant organizing tools✨ Anyone fed up with big tech, big government, and big banks✨ The simply curious—no prerequisite knowledge needed\nAbout Logos\nLogos is both a technology stack and a social movement building infrastructure for self-sovereign network states.\nWe're creating the tools for parallel societies: privacy-preserving communications, censorship-resistant storage, and decentralized consensus—all politically neutral, fully open-source, and designed to restore agency to individuals and communities.\nOur Mission: Upgrade human governance by giving people ownership over the technologies and institutions that shape their lives.\nRead the full vision: Logos Manifesto\n\nRead Farewell to Westphalia: https://logos.co/farewell-to-westphalia/\n\nIf you believe the future shouldn't be determined by decaying bureaucracies and surveillance states...\nIf you're ready to explore how technology can enable new forms of voluntary cooperation and self-governance...\nIf you want to connect with others building toward a more free, private, and human-centric world...\nJoin us.",
      "event_id": "evt-WzraepMnIT8kPTx",
      "event_name": "Logos Circle: Los Angeles",
      "event_status": null,
      "event_timezone": "America/Los_Angeles",
      "event_type": null,
      "event_url": "https://luma.com/29wpdv9a",
      "event_visibility": "public",
      "geo_latitude": 34.044711299999996,
      "geo_longitude": -118.2352851,
      "guest_count": 33,
      "host_name": null,
      "host_username": null,
      "location_city": "Los Angeles",
      "location_country": "USA",
      "max_capacity": null,
      "start_at": "2025-12-03T02:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-11-28T13:26:06.535",
      "duration_minutes": null,
      "end_at": "2025-12-04T20:00:00",
      "event_description": "Welcome to the upcoming gathering of the Logos Circle Brno!\nFrom food insecurity and housing struggles to digital autonomy and surveillance capitalism, we believe meaningful change begins at the local level. This Circle is a chance to deepen our connections, follow up on stories raised last time, and welcome new members into the conversation.\nWhether you’re ready to contribute or just curious to learn more, you’re invited.\nAgenda\nArrival\nSettle in and take some time to reconnect, meet new people, or ask questions.\nIntroductions\nWe’ll kick off by welcoming new participants and reintroducing ourselves. You’ll be invited to share a little about your background and what brings you here.\nCircle Discussion\nIntro to Logos brand unification (https://logos.co)\nDevconnect Buenos Aires\nWinnable issues proposalsAI for children and parents\nDigital Privacy activism (Chat Control, DSA...)\nIssues proposed by other Circles\nParallel Society 2026\nOpen floor for skills-sharing and collaboration\nWrap-up\nWe’ll share next steps, responsibilities, and any volunteering opportunities that arise.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Logos Blockchain, Logos Storage, and Logos Messaging. Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-jxBe37ZR6nOYVNm",
      "event_name": "Logos Circle Brno",
      "event_status": null,
      "event_timezone": "Europe/Prague",
      "event_type": null,
      "event_url": "https://luma.com/olw5rn0s",
      "event_visibility": "public",
      "geo_latitude": 49.1871036,
      "geo_longitude": 16.615579399999998,
      "guest_count": 44,
      "host_name": null,
      "host_username": null,
      "location_city": "Brno-město",
      "location_country": "Czechia",
      "max_capacity": null,
      "start_at": "2025-12-04T16:30:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-11-20T20:06:39.379",
      "duration_minutes": null,
      "end_at": "2025-12-05T02:00:00",
      "event_description": "Bienvenidos al próximo encuentro del Círculo Logos en Ciudad de México\nDesde la inseguridad alimentaria y las dificultades de vivienda hasta la autonomía digital y el capitalismo de vigilancia, creemos que el cambio significativo comienza a nivel local.\nEste Círculo es una oportunidad para profundizar nuestras conexiones, dar seguimiento a las historias planteadas la vez anterior y dar la bienvenida a nuevos miembros a la conversación.\nTanto si estás listo para contribuir como si simplemente tienes curiosidad por aprender más, estás invitado.\nAgenda\nLlegada  \nTómate un momento para instalarte, disfrutar de un aperitivo y aprovecha para reconectar, conocer gente nueva o hacer preguntas.\nPresentaciones\nComenzaremos dando la bienvenida a los nuevos participantes y reintroduciéndonos. Te invitaremos a compartir un poco sobre tu experiencia y lo que te trae aquí.\nDiscusión del Círculo\nBreve resumen de la sesión anterior\nActualizaciones sobre las “historias alcanzables” en una lluvia de ideas grupal\nEspacio abierto para compartir habilidades y fomentar la colaboración\nCierre\nCompartiremos los próximos pasos, la fecha del siguiente encuentro, responsabilidades y cualquier oportunidad de voluntariado que surja.\nAcerca de Logos\nLogos es un movimiento de código abierto que construye un stack tecnológico descentralizado que materializa la visión cypherpunk de territorios digitales autónomos y ciber-estados.\nMessaging: Redes de comunicación anónimas para mensajería resistente a adversarios estatales.\nAlmacenamiento descentralizado para datos persistentes a la coerción, compartición de archivos y distribución de aplicaciones.\nBlockchain que preserva la privacidad para el orden y la gobernanza soberanas.\nEste stack tecnológico es la base necesaria para construir las instituciones sociales, económicas y de gobernanza. Por su parte, las comunidades de aprendizaje gobernarán y sostendrán la red en el espíritu de los cypherpunks originales.\nCon el tiempo, estas instituciones poblarán un mercado competitivo que puede llenar vacíos de gobernanza en el mundo real, ofreciendo servicios públicos confiables y resistentes a la corrupción en cualquier lugar al que llegue Internet.\nLee nuestro Manifiesto para profundizar más sobre la tecnología e ideales de Logos.\nTambién te invitamos a visitar el sitio web Logos",
      "event_id": "evt-XKGZO0UKx2iECTt",
      "event_name": "Círculo LOGOS CdMx",
      "event_status": null,
      "event_timezone": "America/Mexico_City",
      "event_type": null,
      "event_url": "https://luma.com/d8bzugu8",
      "event_visibility": "public",
      "geo_latitude": 19.437459399999998,
      "geo_longitude": -99.1643347,
      "guest_count": 23,
      "host_name": null,
      "host_username": null,
      "location_city": "Ciudad de México",
      "location_country": "Mexico",
      "max_capacity": null,
      "start_at": "2025-12-05T00:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-12-07T16:55:15.181",
      "duration_minutes": null,
      "end_at": "2025-12-10T14:00:00",
      "event_description": "Welcome to the second upcoming gathering of the Logos Circle Nairobi.\nFrom food insecurity and housing struggles to digital autonomy and surveillance capitalism, we believe meaningful change begins at the local level. This Circle is a chance to deepen our connections, follow up on stories raised last time, and welcome new members into the conversation.\nWhether you’re ready to contribute or just curious to learn more, you’re invited.\nAgenda\nArrival & Beverages\nSettle in with a selection of drinks and take some time to reconnect, meet new people, or ask questions.\nIntroductions\nWe’ll kick off by welcoming new participants and reintroducing ourselves. You’ll be invited to share a little about your background and what brings you here.\nCircle Discussion\nQuick recap of last session and updates on active “winnable stories”\nGroup discussion on emerging issues and ideas for possible new initiatives.\nOpen floor for skills-sharing and collaboration.\nWrap-up\nWe’ll share next steps, next time we’ll meet, responsibilities, and any volunteering opportunities that arise.\nAbout Logos.\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-0zUchmzC4FXWo13",
      "event_name": "Logos Circle Nairobi",
      "event_status": null,
      "event_timezone": "Africa/Nairobi",
      "event_type": null,
      "event_url": "https://luma.com/zqtfq8x8",
      "event_visibility": "public",
      "geo_latitude": -1.2994603999999998,
      "geo_longitude": 36.781061099999995,
      "guest_count": 81,
      "host_name": null,
      "host_username": null,
      "location_city": "Nairobi",
      "location_country": "Kenya",
      "max_capacity": null,
      "start_at": "2025-12-10T12:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-11-17T14:34:13.533",
      "duration_minutes": null,
      "end_at": "2025-12-10T21:00:00",
      "event_description": "Welcome to the final gathering of the Logos Circle Lisbon for 2025!\nAt our December circle, we’ll come together to celebrate the wins we’ve achieved this year as a community — from securing the new community centre in Quinta do Mocho to supporting the short film that amplifies the voices of underrepresented diasporic artists.\nAgenda\nWelcome drinks and snacks\nEnjoy locally sourced snacks and drinks while we say hello and settle in.\nIntroductions\nGet to know your local Logos Circle Admins. You’ll be invited to share a bit about your story and why this work is meaningful to you.\nFocus on local issues\nA discussion about local initiatives already underway, emerging challenges, and how Logos can support through social action.\nFarewell!\nWe’ll share the roadmap for how you can get involved and when we’ll gather again.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols for consensus, storage, and communications. Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-yYM4zNkP01Xd90j",
      "event_name": "Logos Circle Lisbon",
      "event_status": null,
      "event_timezone": "Europe/Lisbon",
      "event_type": null,
      "event_url": "https://luma.com/sefvbprj",
      "event_visibility": "public",
      "geo_latitude": 38.71642430000001,
      "geo_longitude": -9.1384666,
      "guest_count": 136,
      "host_name": null,
      "host_username": null,
      "location_city": "Lisboa",
      "location_country": "Portugal",
      "max_capacity": null,
      "start_at": "2025-12-10T19:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-12-01T17:41:01.654",
      "duration_minutes": null,
      "end_at": "2025-12-11T19:30:00",
      "event_description": "Benvinguts al Logos Circle Barcelona\nLa comunitat tecnològica i creativa de Barcelona és l’espai perfecte per explorar els network states (estats en xarxa) i generar impacte col·lectiu. Amb el suport d’AKASHA Hub, reunim cypherpunks, tecnòlegs, artistes, periodistes, activistes, entitats locals i líders comunitaris.\nCreem un espai regular per al diàleg, la col·laboració i l’acció sobre els temes clau de la comunitat.\nIdiomes: anglès, castellà, català\nAgenda\nBegudes & snacks – Benvinguda i encontre.\nPresentacions – Organitzadors i participants.\nLogos & Network States – Introducció + Q&A.\nQüestions locals – Reptes i iniciatives.\nPròxims passos – Full de ruta i cloenda.\nSobre Logos\nLogos és una tecnologia i moviment descentralitzat, neutral i respectuós amb la privacitat. Impulsa protocols peer-to-peer de governança, arxiu i missatgeria — base dels network states (estats en xarxa) i institucions sense fronteres.\nCom a moviment de base, Logos construeix comunitats locals que sostenen la xarxa en l’esperit dels cypherpunks.\nLlegeix el nostre manifest per saber-ne més.\n\n______\nBienvenidos al Logos Circle Barcelona\nLa comunidad tecnológica y creativa de Barcelona es el lugar ideal para explorar los network states (estados en red) e impulsar un impacto colectivo. Con el apoyo de AKASHA Hub, reunimos a cypherpunks, tecnólogos, artistas, periodistas, activistas, organizaciones locales y líderes comunitarios.\nCreamos un espacio regularmente para el diálogo, la colaboración y la acción en torno a los temas que más nos importan.\nIdiomas: inglés, español, catalán\nAgenda\nBebidas & snacks – Bienvenida y encuentro.\nPresentaciones – Organizadores y participantes.\nLogos & Network States – Introducción + Q&A.\nTemas locales – Retos e iniciativas.\nPróximos pasos – Hoja de ruta y cierre.\nSobre Logos\nLogos es una tecnología y movimiento descentralizado, neutral y orientado a la privacidad. Impulsa protocolos peer-to-peer de gobernanza, archivo y mensajería — base de los network states (estados en red) y de instituciones sin fronteras.\nComo movimiento de base, Logos crea comunidades locales que sostienen la red en el espíritu de los cypherpunks.\nLee nuestro manifiesto para saber más.\n______\nWelcome to the Logos Circle Barcelona!\nBarcelona’s creative and tech community, rooted in its culture and history, is the perfect place to explore network states and drive collective impact. With support from AKASHA Hub, we gather cypherpunks, technologists, artists, journalists, activists, local charities and community leaders.\nJoin us to open a regular space for dialogue, collaboration, and action on the issues that matter most.\nLanguages: English, Spanish, Catalan\nAgenda\nDrinks & snacks – Meet and settle in.\nIntroductions – Organisers + participants share stories.\nLogos & Network States – Why we’re building them + Q&A.\nLocal issues – Group discussion on challenges & initiatives.\nNext steps – Roadmap and farewell.\nAbout Logos\nLogos is a decentralised, privacy-preserving, neutral technology and movement. It powers peer-to-peer protocols for governance, storage, and messaging — foundations for network states and borderless institutions.\nAs a grassroots movement, Logos builds local communities to sustain the network in the spirit of the cypherpunks.\nRead our manifesto to learn more.",
      "event_id": "evt-Fde367isyE6lrec",
      "event_name": "Logos Circle Barcelona #4",
      "event_status": null,
      "event_timezone": "Europe/Madrid",
      "event_type": null,
      "event_url": "https://luma.com/jmetml32",
      "event_visibility": "public",
      "geo_latitude": 41.4109567,
      "geo_longitude": 2.1912024999999997,
      "guest_count": 78,
      "host_name": null,
      "host_username": null,
      "location_city": "Barcelona",
      "location_country": "Spain",
      "max_capacity": null,
      "start_at": "2025-12-11T17:30:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-12-01T11:32:40.438",
      "duration_minutes": null,
      "end_at": "2025-12-13T17:30:00",
      "event_description": "The Logos Network Abeokuta Circle Meetup is designed to bring together a diverse ecosystem of creators, builders, and innovators to explore the emerging opportunities within the Logos Network. The event aims to extend community education, encourage collaboration, and introduce practical pathways for contributing to the Logos ecosystem.\n\nThis meetup will serve as a platform for learning, networking, and hands-on exploration of decentralized technologies, fostering growth for both beginners and experienced builders in the city of Abeokuta\n.",
      "event_id": "evt-aWiDTpSTa9iQfnP",
      "event_name": "Logos Abeokuta Circle",
      "event_status": null,
      "event_timezone": "Africa/Lagos",
      "event_type": null,
      "event_url": "https://luma.com/kmqw62yh",
      "event_visibility": "public",
      "geo_latitude": 7.0943011,
      "geo_longitude": 3.3963628999999997,
      "guest_count": 12,
      "host_name": null,
      "host_username": null,
      "location_city": "Kobape",
      "location_country": "Nigeria",
      "max_capacity": null,
      "start_at": "2025-12-13T14:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-12-04T18:26:20.387",
      "duration_minutes": null,
      "end_at": "2025-12-14T13:30:00",
      "event_description": "Join us as we discuss Logos, decentralization, privacy and how we can identify locally important issues to solve them!",
      "event_id": "evt-PNxLbxmxsWYklRr",
      "event_name": "Logos Bengaluru Circle",
      "event_status": null,
      "event_timezone": "Asia/Calcutta",
      "event_type": null,
      "event_url": "https://luma.com/yhxit6lr",
      "event_visibility": "public",
      "geo_latitude": 12.9788825,
      "geo_longitude": 77.6417088,
      "guest_count": 24,
      "host_name": null,
      "host_username": null,
      "location_city": "Bengaluru",
      "location_country": "India",
      "max_capacity": null,
      "start_at": "2025-12-14T11:30:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-12-03T21:10:49.119",
      "duration_minutes": null,
      "end_at": "2025-12-17T19:00:00",
      "event_description": "Welcome to the upcoming gathering of the Logos Circle Prague!\nFrom food insecurity and housing struggles to digital autonomy and surveillance capitalism, we believe meaningful change begins at the local level. This Circle is a chance to deepen our connections, follow up on stories raised last time, and welcome new members into the conversation.\nWhether you’re ready to contribute or just curious to learn more, you’re invited.\nAgenda\nArrival & Beverages\nSettle in with a selection of drinks and take some time to reconnect, meet new people, or ask questions.\nIntroductions\nWe’ll kick off by welcoming new participants and reintroducing ourselves. You’ll be invited to share a little about your background and what brings you here.\nCircle Discussion\nQuick recap of last session and updates on active “winnable stories”\nGroup discussion on emerging issues and ideas for possible new initiatives\nOpen floor for skills-sharing and collaboration\nWrap-up\nWe’ll share next steps, next time we’ll meet, responsibilities, and any volunteering opportunities that arise.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-DSEUyCJZenpX6BO",
      "event_name": "Logos Circle Prague #2",
      "event_status": null,
      "event_timezone": "Europe/Prague",
      "event_type": null,
      "event_url": "https://luma.com/ag4nnwzs",
      "event_visibility": "public",
      "geo_latitude": 50.103352699999995,
      "geo_longitude": 14.450541099999997,
      "guest_count": 26,
      "host_name": null,
      "host_username": null,
      "location_city": "Hlavní město Praha",
      "location_country": "Czechia",
      "max_capacity": null,
      "start_at": "2025-12-17T17:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-12-05T15:19:12.547",
      "duration_minutes": null,
      "end_at": "2025-12-17T20:00:00",
      "event_description": "Welcome to the Logos Circle London chapter!\nWe believe real change starts at the local level. Join us in the heart of the City, steps from the Monument to the Great Fire of London. Fun fact: This 202-foot Doric column, crowned by a gilded flame, exactly 202 feet west of where the 1666 fire started, stands as tribute to London's unbreakable spirit, honouring the city's phoenix-like rebirth and rapid reconstruction into a grander metropolis.\nEveryone is welcome, whether you're ready to get involved or just curious to learn more.\nAgenda\nWelcome and Intros \nFind us in Boardroom #1, where we will sit down and discuss the year in review for our Logos London circle, including what we've achieved, progress on our winnable issue, opportunities to get involved, solutions built by local members, and an open floor for relevant topics (privacy, exit, debt, activism, decentralisation, open source software, movement initiatives and more).\nSurfacing local issues\nThe circle encourages group discussions on local issues, emerging challenges, and active initiatives. Together we’ll explore where Logos tools and networks can support real-world action.\nGood to Know \nReserve some time to meet your local Logos Circle members. You’ll be invited to share a bit of your story, why you’re here and what draws you to this work.\nAfter 8PM, for those who would like to stick around for some networking and chitchat, we will grab a drink at the local pub.\n\nAbout Logos\nLogos is the sovereign private-by-default digital infrastructure and social movement built to revitalise civil society.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-QJdMfIJwqTNMcZv",
      "event_name": "Logos Circle London",
      "event_status": null,
      "event_timezone": "Europe/London",
      "event_type": null,
      "event_url": "https://luma.com/f3hi5rbp",
      "event_visibility": "public",
      "geo_latitude": 51.51049,
      "geo_longitude": -0.0898315,
      "guest_count": 94,
      "host_name": null,
      "host_username": null,
      "location_city": "London",
      "location_country": "UK",
      "max_capacity": null,
      "start_at": "2025-12-17T18:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-12-15T15:58:28.122",
      "duration_minutes": null,
      "end_at": "2025-12-19T00:00:00",
      "event_description": "Bem-vindos ao primeiro Logos Circle Florianópolis!\nDe insegurança habitacional e alimentar à autonomia digital e ao capitalismo de vigilância, acreditamos que a verdadeira mudança começa no nível local. Este primeiro evento é uma oportunidade para conhecer e conectar com pessoas, alinhar propósitos e começar a estabelecer as bases para projetos importantes. Todos são bem-vindos, seja quem está pronto para se envolver ou apenas curioso para saber mais.\nAGENDA\nApresentações\nConheça os Administradores locais do Logos Circle. Você será convidado a compartilhar um pouco sobre sua história e por que este trabalho é significativo para você.\nFoco em Questões Locais\nUma discussão sobre iniciativas locais já em andamento, desafios emergentes e como a Logos pode apoiar por meio da ação social.\nDespedida e Próximos Passos\nCompartilharemos o roteiro de como você pode se envolver e quando nos reuniremos novamente.\nObs: Bebidas de boas-vindas e aperitivos serão servidos no local.\nSobre a Logos\nA Logos é um stack de tecnologia totalmente descentralizado, com preservação de privacidade e politicamente neutro. O stack inclui três protocolos modulares e descentralizados: Blockchain, Mensagens e Armazenamento (Storage). Combinados, eles fornecem a base técnica para cyberestados, sociedades paralelas, Network States ou qualquer instituição pública sem fronteiras baseada em consentimento voluntário.\nA Logos é também um conjunto de comunidades em aprendizado que irão governar e sustentar a rede no espírito dos cypherpunks originais. Juntas, elas formam o movimento de base necessário para construir as instituições sociais, econômicas e de governo que viverão sobre o stack de tecnologia.\nEventualmente, essas instituições irão popular um mercado competitivo que pode preencher lacunas de governança no mundo real, fornecendo serviços públicos com minimização de confiança e resistentes à corrupção onde quer que a internet possa alcançar.\nLeia nosso manifesto para se aprofundar em nossos ideais e tecnologia.\n\nWelcome to the first Logos Circle Florianópolis!\nFrom housing and food insecurity to digital autonomy and surveillance capitalism, we believe real change starts at the local level. This first event is a chance to meet and connect with people, align on purpose, and begin laying the groundwork for projects that matter. Everyone is welcome, whether you are ready to get involved or just curious to learn more.\nAGENDA\nIntroductions\nGet to know your local Logos Circle Admins. You’ll be invited to share a bit about your story and why this work is meaningful to you.\nFocus on Local Issues\nA discussion about local initiatives already underway, emerging challenges, and how Logos can support through social action.\nFarewell and Next Steps\nWe’ll share the roadmap for how you can get involved and when we’ll gather again.\nNote: Welcome drinks and appetizers will be served on site.\nAbout Logos\nLogos is a fully decentralized, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralized protocols: Blockchain, Messaging, and Storage. Combined, they provide the technical foundation for cyber states, parallel societies, Network States, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimized, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-Bs5CtLRdWQs3fCX",
      "event_name": "Logos Circle Florianópolis",
      "event_status": null,
      "event_timezone": "Europe/Lisbon",
      "event_type": null,
      "event_url": "https://luma.com/dkqp8ura",
      "event_visibility": "public",
      "geo_latitude": -27.544825499999998,
      "geo_longitude": -48.501678,
      "guest_count": 29,
      "host_name": null,
      "host_username": null,
      "location_city": "Florianópolis",
      "location_country": "Brazil",
      "max_capacity": null,
      "start_at": "2025-12-18T22:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-12-18T12:23:38.534",
      "duration_minutes": null,
      "end_at": "2025-12-21T13:00:00",
      "event_description": "Welcome to the first gathering of Logos Circle Lagos.\nFrom housing and food insecurity to digital autonomy and surveillance capitalism, we believe real change starts at the local level. This first event is a chance to meet and connect with your peers, align on purpose, and begin laying the groundwork for projects that matter. Everyone is welcome, whether you're ready to get involved or just curious to learn more.\nAgenda\nWelcome drinks and snacks\nEnjoy locally sourced snacks and drinks while we say hello and settle in.\nIntroductions\nGet to know your local Logos Circle Admins. You’ll be invited to share a bit about your story and why this work is meaningful to you.\nFocus on local issues\nA discussion about local initiatives already underway, emerging challenges, and how Logos can support through social action.\nFarewell!\nWe’ll share the roadmap for how you can get involved and when we’ll gather again.\nAbout Logos\nLogos is a fully decentralized, privacy-first, and politically neutral technology stack made up of three modular protocols: blockchain, messaging, and storage. Together, they form the infrastructure for cyber states, network societies, and borderless public institutions built on voluntary participation.\nEach month, we host a community circle focused on real-world challenges — from housing and food security to digital autonomy and surveillance. This inaugural gathering is an opportunity to connect with peers, align around shared values, and begin shaping meaningful, locally driven projects. Whether you’re actively looking to contribute or simply curious to learn, you’re welcome to join.",
      "event_id": "evt-pkTymj6us7Y33F2",
      "event_name": "Logos Circle Lagos",
      "event_status": null,
      "event_timezone": "Africa/Lagos",
      "event_type": null,
      "event_url": "https://luma.com/h8ppab31",
      "event_visibility": "public",
      "geo_latitude": 6.4335308,
      "geo_longitude": 3.4258897999999998,
      "guest_count": 43,
      "host_name": null,
      "host_username": null,
      "location_city": "Lagos",
      "location_country": "Nigeria",
      "max_capacity": null,
      "start_at": "2025-12-21T11:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-12-24T09:46:57.579",
      "duration_minutes": null,
      "end_at": "2026-01-04T13:00:00",
      "event_description": "Welcome to the first gathering of Logos Circle Abuja.\nFrom housing and food insecurity to digital autonomy and surveillance capitalism, we believe real change starts at the local level. This first event is a chance to meet and connect with your peers, align on purpose, and begin laying the groundwork for projects that matter. Everyone is welcome, whether you're ready to get involved or just curious to learn more.\nAgenda\nWelcome drinks and snacks\nEnjoy locally sourced snacks and drinks while we say hello and settle in.\nIntroductions\nGet to know your local Logos Circle Admins. You’ll be invited to share a bit about your story and why this work is meaningful to you.\nFocus on local issues\nA discussion about local initiatives already underway, emerging challenges, and how Logos can support through social action.\nFarewell!\nWe’ll share the roadmap for how you can get involved and when we’ll gather again.\nAbout Logos\nLogos is a fully decentralized, privacy-first, and politically neutral technology stack made up of three modular protocols: blockchain, messaging, and storage. Together, they form the infrastructure for cyber states, network societies, and borderless public institutions built on voluntary participation.\nEach month, we host a community circle focused on real-world challenges — from housing and food security to digital autonomy and surveillance. This inaugural gathering is an opportunity to connect with peers, align around shared values, and begin shaping meaningful, locally driven projects. Whether you’re actively looking to contribute or simply curious to learn, you’re welcome to join.",
      "event_id": "evt-3Cxa8NZWh94OFIM",
      "event_name": "Logos Circle Abuja",
      "event_status": null,
      "event_timezone": "Africa/Lagos",
      "event_type": null,
      "event_url": "https://luma.com/gzo5eqd0",
      "event_visibility": "public",
      "geo_latitude": 9.0426215,
      "geo_longitude": 7.5034898,
      "guest_count": 21,
      "host_name": null,
      "host_username": null,
      "location_city": "Abuja",
      "location_country": "Nigeria",
      "max_capacity": null,
      "start_at": "2026-01-04T11:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-12-29T19:51:32.096",
      "duration_minutes": null,
      "end_at": "2026-01-07T21:00:00",
      "event_description": "Welcome to the first gathering of the Logos Circle Lisbon for 2026!\nAt our January circle, we’ll come together to celebrate the wins we’ve achieved last year — from securing the new community centre in Quinta do Mocho to supporting the short film that amplifies the voices of underrepresented diasporic artists.\nAgenda\nWelcome drinks and snacks\nEnjoy locally sourced snacks and drinks while we say hello and settle in.\nIntroductions\nGet to know your local Logos Circle Stewards and community. You’ll be invited to share a bit about your story and why this work is meaningful to you.\nFocus on local issues\nA discussion about local initiatives already underway, emerging challenges, and how Logos can support through social action.\nFarewell!\nWe’ll share the roadmap for how you can get involved and when we’ll gather again.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols for consensus, storage, and communications. Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-lpxkeu6gGlkKCx2",
      "event_name": "Logos Circle Lisbon",
      "event_status": null,
      "event_timezone": "Europe/Lisbon",
      "event_type": null,
      "event_url": "https://luma.com/5c76446l",
      "event_visibility": "public",
      "geo_latitude": 38.71642430000001,
      "geo_longitude": -9.1384666,
      "guest_count": 245,
      "host_name": null,
      "host_username": null,
      "location_city": "Lisboa",
      "location_country": "Portugal",
      "max_capacity": null,
      "start_at": "2026-01-07T19:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-12-09T18:55:08.685",
      "duration_minutes": null,
      "end_at": "2026-01-13T06:00:00",
      "event_description": "Logos Circle: Los Angeles - Work Group Session\nLocation provided to approved attendees\n\nWhat We're Building\nThis is a work session for the LA Logos Circle, the objective is to move from concepts to code. Following productive discussions at previous gatherings, we're ready to begin technical implementation on a proof-of-concept for privacy preserving local community tools.\nOur focus: an anonymous neighborhood engagement platform that lets people participate in local issues without sacrificing their privacy. Think community reporting and coordination, but built on principles of self-sovereignty rather than surveillance.\nSession Objectives\nWe'll break into working groups to tackle core components:\nIdentity & Privacy Layer\nZero-knowledge approaches to verify community membership without exposing who you are or exactly where you live.\nMessaging Infrastructure\nLeveraging Logos Messaging for private, censorship-resistant communication between neighbors.\nIncentive Mechanisms\nDesigning staking and reputation systems that encourage genuine participation while deterring bad actors.\nUser Experience\nMaking privacy-first design actually usable for everyday community members.\nWho Should Attend\nThis session is for builders ready to contribute. Whether your expertise is in cryptography, frontend development, mechanism design, or UX, if you're prepared to roll up your sleeves and help prototype solutions for real LA community challenges, we want you there.\nPrior attendance at Logos Circle events is helpful but not required. Familiarity with the Logos tech stack (Blockchain, Storage, Messaging) is a plus.\nDetails\nFood and drinks provided. Come ready to work.\nThis is an invite-only session. If you're interested in attending, request access and we'll follow up with location details for approved guests.\n\nThe LA Logos Circle is part of a global network of communities building decentralized infrastructure for self-sovereign governance. Learn more at circles.logos.co",
      "event_id": "evt-KKZ9pDkyl057l74",
      "event_name": "Logos Circle: Los Angeles [Work Group]",
      "event_status": null,
      "event_timezone": "America/Los_Angeles",
      "event_type": null,
      "event_url": "https://luma.com/akbbxce2",
      "event_visibility": "public",
      "geo_latitude": 33.9932584,
      "geo_longitude": -118.480598,
      "guest_count": 8,
      "host_name": null,
      "host_username": null,
      "location_city": "Los Angeles",
      "location_country": "USA",
      "max_capacity": null,
      "start_at": "2026-01-13T02:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-12-09T11:26:37.772",
      "duration_minutes": null,
      "end_at": "2026-01-21T19:00:00",
      "event_description": "Welcome to the upcoming gathering of the Logos Circle Prague!\nFrom food insecurity and housing struggles to digital autonomy and surveillance capitalism, we believe meaningful change begins at the local level. This Circle is a chance to deepen our connections, follow up on stories raised last time, and welcome new members into the conversation.\nWhether you’re ready to contribute or just curious to learn more, you’re invited.\nAgenda\nArrival & Beverages\nSettle in with a selection of drinks and take some time to reconnect, meet new people, or ask questions.\nIntroductions\nWe’ll kick off by welcoming new participants and reintroducing ourselves. You’ll be invited to share a little about your background and what brings you here.\nCircle Discussion\nQuick recap of last session and updates on active “winnable stories”\nGroup discussion on emerging issues and ideas for possible new initiatives\nOpen floor for skills-sharing and collaboration\nWrap-up\nWe’ll share next steps, next time we’ll meet, responsibilities, and any volunteering opportunities that arise.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Nomos (consensus), Codex (storage), and Waku (messaging). Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-qUXIAzvaQdNKC3u",
      "event_name": "Logos Circle Prague #3",
      "event_status": null,
      "event_timezone": "Europe/Prague",
      "event_type": null,
      "event_url": "https://luma.com/em5brzs2",
      "event_visibility": "public",
      "geo_latitude": 50.103352699999995,
      "geo_longitude": 14.450541099999997,
      "guest_count": 19,
      "host_name": null,
      "host_username": null,
      "location_city": "Hlavní město Praha",
      "location_country": "Czechia",
      "max_capacity": null,
      "start_at": "2026-01-21T17:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2026-01-07T18:25:46.914",
      "duration_minutes": null,
      "end_at": "2026-01-22T01:00:00",
      "event_description": "Welcome to the upcoming gathering of the Logos Circle Boston!\nFrom food insecurity and housing struggles to digital autonomy and surveillance capitalism, we believe meaningful change begins at the local level. This Circle is a chance to deepen our connections, follow up on stories raised as we connect, and welcome new members into the conversation.\nWhether you’re ready to contribute or just curious to learn more, you’re invited.\nAgenda\nArrival\nSettle in  and take some time to reconnect, meet new people, or ask questions.\n\nWe would love to have food and drinks, but we can't in the library.\nIntroductions\nWe’ll kick off by welcoming new participants and reintroducing ourselves. You’ll be invited to share a little about your background and what brings you here.\nCircle Discussion\nQuick recap of last session and updates on active “winnable stories”\nGroup discussion on emerging issues and ideas for possible new initiatives\nOpen floor for skills-sharing and collaboration\nWrap-up\nWe’ll share next steps, next time we’ll meet, responsibilities, and any volunteering opportunities that arise.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Blockchain, Storage, and Messaging. Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-MoZpDfND8h9cn2u",
      "event_name": "Logos Circle - Boston",
      "event_status": null,
      "event_timezone": "America/New_York",
      "event_type": null,
      "event_url": "https://luma.com/shr8nw8s",
      "event_visibility": "public",
      "geo_latitude": 42.3492855,
      "geo_longitude": -71.078283,
      "guest_count": 2,
      "host_name": null,
      "host_username": null,
      "location_city": "Boston",
      "location_country": "USA",
      "max_capacity": null,
      "start_at": "2026-01-21T23:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2026-01-05T19:52:54.205",
      "duration_minutes": null,
      "end_at": "2026-01-22T21:00:00",
      "event_description": "Logos Circle Florianópolis\nDe insegurança habitacional e alimentar à autonomia digital e ao capitalismo de vigilância, acreditamos que a verdadeira mudança começa no nível local. Este segundo evento é uma oportunidade para conhecer e conectar com pessoas, alinhar propósitos e começar a estabelecer as bases para projetos importantes. Todos são bem-vindos, seja quem está pronto para se envolver ou apenas curioso para saber mais.\nAGENDA\nApresentações\nConheça os administradores locais do Logos Circle Florianópolis, compartilhe um pouco sobre sua história e por que este trabalho é significativo para você.\nFoco em Questões Locais\nUma discussão sobre iniciativas locais já em andamento, desafios emergentes e como a Logos pode apoiar por meio da ação social.\nDespedida e Próximos Passos\nCompartilharemos o roteiro de como você pode se envolver e quando nos reuniremos novamente.\nObs: Bebidas de boas-vindas e aperitivos serão servidos no local.\nSobre a Logos\nA Logos é um stack de tecnologia totalmente descentralizado, com preservação de privacidade e politicamente neutro. O stack inclui três protocolos modulares e descentralizados: Blockchain, Mensagens e Armazenamento (Storage). Combinados, eles fornecem a base técnica para cyberestados, sociedades paralelas, Network States ou qualquer instituição pública sem fronteiras baseada em consentimento voluntário.\nA Logos é também um conjunto de comunidades em aprendizado que irão governar e sustentar a rede no espírito dos cypherpunks originais. Juntas, elas formam o movimento de base necessário para construir as instituições sociais, econômicas e de governo que viverão sobre o stack de tecnologia.\nEventualmente, essas instituições irão popular um mercado competitivo que pode preencher lacunas de governança no mundo real, fornecendo serviços públicos com minimização de confiança e resistentes à corrupção onde quer que a internet possa alcançar.\nLeia nosso manifesto para se aprofundar em nossos ideais e tecnologia.\n\nWelcome to the Logos Circle Florianópolis!\nFrom housing and food insecurity to digital autonomy and surveillance capitalism, we believe real change starts at the local level. This second event is a chance to meet and connect with people, align on purpose, and begin laying the groundwork for projects that matter. Everyone is welcome, whether you are ready to get involved or just curious to learn more.\nAGENDA\nIntroductions\nGet to know your local Logos Circle Admins. You’ll be invited to share a bit about your story and why this work is meaningful to you.\nFocus on Local Issues\nA discussion about local initiatives already underway, emerging challenges, and how Logos can support through social action.\nFarewell and Next Steps\nWe’ll share the roadmap for how you can get involved and when we’ll gather again.\nNote: Welcome drinks and appetizers will be served on site.\nAbout Logos\nLogos is a fully decentralized, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralized protocols: Blockchain, Messaging, and Storage. Combined, they provide the technical foundation for cyber states, parallel societies, Network States, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimized, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-fmjjiMMZyjNngZc",
      "event_name": "Logos Circle Florianópolis #2",
      "event_status": null,
      "event_timezone": "Europe/Lisbon",
      "event_type": null,
      "event_url": "https://luma.com/c37eotup",
      "event_visibility": "public",
      "geo_latitude": -27.567424100000004,
      "geo_longitude": -48.5073368,
      "guest_count": 38,
      "host_name": null,
      "host_username": null,
      "location_city": "Florianópolis",
      "location_country": "Brazil",
      "max_capacity": null,
      "start_at": "2026-01-22T19:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2026-01-16T13:21:38.815",
      "duration_minutes": null,
      "end_at": "2026-01-22T21:00:00",
      "event_description": "Welcome to the first gathering of the Logos Circle Porto!\nFrom housing and food insecurity to digital autonomy and surveillance capitalism, we believe real change starts at the local level.\nThis first event is a chance to meet and connect with your peers, align on purpose, and begin laying the groundwork for projects that matter. Everyone is welcome, whether you're ready to get involved or just curious to learn more.\nOver the past few months, the Porto Circle has been quietly taking shape. Its first winnable issue is already being scoped remotely: the creation of a digital escape route for domestic violence survivors, as part of the Safety in Numbers campaign. This event marks the moment those early ideas come together in person, opening the door to collective action and real-world impact.\nYou can read more about the proposal here.\nAgenda\nWelcome drinks and snacks\nEnjoy locally sourced snacks and drinks while we say hello and settle in.\nIntroductions\nGet to know your local Logos Circle stewards. You’ll be invited to share a bit about your story and why this work is meaningful to you.\nFocus on the winnable issue so far\nGet up to speed on the key issue of domestic violence in Portugal, what solution is being proposed for the Circle, and how you can support.\nFarewell!\nWe’ll share the roadmap for how you can get involved and when we’ll gather again.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Blockchain, Messaging, and Storage. Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-xywExutUqDWcJBW",
      "event_name": "Logos Circle: Porto",
      "event_status": null,
      "event_timezone": "Europe/Lisbon",
      "event_type": null,
      "event_url": "https://luma.com/st1vmc26",
      "event_visibility": "public",
      "geo_latitude": 41.1563608,
      "geo_longitude": -8.6299837,
      "guest_count": 3,
      "host_name": null,
      "host_username": null,
      "location_city": "Porto",
      "location_country": "Portugal",
      "max_capacity": null,
      "start_at": "2026-01-22T19:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2026-01-11T02:04:25.005",
      "duration_minutes": null,
      "end_at": "2026-01-24T02:00:00",
      "event_description": "Bienvenidos al tercer encuentro del Círculo Logos en Ciudad de México\nDesde la inseguridad alimentaria y las dificultades de vivienda hasta la autonomía digital y el capitalismo de vigilancia, creemos que el cambio significativo comienza a nivel local.  Este Círculo es una oportunidad para profundizar nuestras conexiones, seguimiento a las acciones sociales que queremos desarrollar y dar la bienvenida a nuevos miembros.\nTanto si estás listo para contribuir como si simplemente tienes curiosidad por escuchar o aprender, estás invitado.\nAgenda\nLlegada\nTómate un momento para instalarte, disfrutar de un aperitivo y aprovecha para reconectar, conocer gente nueva o hacer preguntas.\nPresentaciones\nComenzaremos dando la bienvenida a los nuevos participantes y reintroduciéndonos. Te invitaremos a compartir un poco sobre tu experiencia y lo que te trae aquí.\nDiscusión del Círculo\nBreve resumen de la sesión anterior\nActualizaciones sobre las “historias alcanzables” en una lluvia de ideas grupal\nEspacio abierto para compartir habilidades y fomentar la colaboración\nCierre\nCompartiremos los próximos pasos, la fecha del siguiente encuentro, responsabilidades y cualquier oportunidad de voluntariado que surja.\nAcerca de Logos\nLogos es un movimiento de código abierto que construye un stack tecnológico descentralizado que materializa la visión cypherpunk de territorios digitales autónomos y ciber-estados.\nMessaging: Redes de comunicación anónimas para mensajería resistente a adversarios estatales.\nAlmacenamiento descentralizado para datos persistentes a la coerción, compartición de archivos y distribución de aplicaciones.\nBlockchain que preserva la privacidad para el orden y la gobernanza soberanas.\nEste stack tecnológico es la base necesaria para construir las instituciones sociales, económicas y de gobernanza. Por su parte, las comunidades de aprendizaje gobernarán y sostendrán la red en el espíritu de los cypherpunks originales.\nCon el tiempo, estas instituciones poblarán un mercado competitivo que puede llenar vacíos de gobernanza en el mundo real, ofreciendo servicios públicos confiables y resistentes a la corrupción en cualquier lugar al que llegue Internet.\nTe invitamos a leer nuestro Manifiesto para profundizar más sobre la tecnología e ideales de Logos.\nTambién te invitamos a visitar el sitio web Logos",
      "event_id": "evt-gtsRO7jnaqEMqcM",
      "event_name": "Círculo Logos CdMx",
      "event_status": null,
      "event_timezone": "America/Mexico_City",
      "event_type": null,
      "event_url": "https://luma.com/i020ssyc",
      "event_visibility": "public",
      "geo_latitude": 19.371344999999998,
      "geo_longitude": -99.1822052,
      "guest_count": 19,
      "host_name": null,
      "host_username": null,
      "location_city": "Ciudad de México",
      "location_country": "Mexico",
      "max_capacity": null,
      "start_at": "2026-01-24T00:30:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2026-01-12T14:56:44.945",
      "duration_minutes": null,
      "end_at": "2026-01-24T11:00:00",
      "event_description": "Първи Балкански Кръг!\nДобре дошли на първата среща на Кръг Logos на Балканите, която се провежда в Русе - Града на първите неща. Русе отдавна е място където се раждат нови идеи, което го прави естествена отправна точка за изграждането на местна общност Logos на Балканите. Това първо събитие е възможност да се срещнете с колеги, да обсъдите общи проблеми и да видите как децентрализираната технология и социалните действия могат да подкрепят значими промени на местно ниво.\nПрограма\nНапитки и закуски за Добре дошли.\nНасладете се на местни закуски и напитки, докато се поздравяваме и се настаняваме.\nПредставяне\nЗапознайте се с местните администратори на Кръг Logos. Ще бъдете поканени да споделите нещо за вашата история и защо тази работа е от значение за вас.\nФокусиране върху местни проблеми\nДискусия за вече започнати местни инициативи, възникващи предизвикателства и как Logos може окаже подкрепа чрез социални действия.\nСбогом!\nЩе споделим пътната карта за това как можете да се включите и кога ще се съберем отново.\nЗа Logos\nLogos е напълно децентрализирана, спазваща поверителност и политически неутрална технологична платформа. Стека включва три модулни децентрализирани протокола: Блокчейн, Съобщения, и Съхранение. В комбинация, те осигуряват техническата основа за кибер държави, паралелни общества, мрежови държави или всякакви публични институции без граници, основани на доброволно съгласие.\nLogos е и колекция от учебни общности, които ще управляват и поддържат мрежата в духа на оригиналните cypherpunks. Заедно, те формират гражданското движение необходимо за изграждането на социалните, икономическите и управленските институции които ще съществуват в технологичния стек.\nВ крайна сметка, тези институции ще се включат в конкурентен пазар, който може да запълни празнините в управлението в реалния свят, предоставяйки публични услуги с минимално участие на външни посредници и устойчиви на корупция, навсякъде където има достъп до интернет.\nПрочетете нашия манифест, за да се запознаете по-подробно с нашите идеали и технология.",
      "event_id": "evt-jR0ctEg18tfcm0c",
      "event_name": "Logos Circle Ruse",
      "event_status": null,
      "event_timezone": "Europe/Sofia",
      "event_type": null,
      "event_url": "https://luma.com/vxq4s3cs",
      "event_visibility": "public",
      "geo_latitude": 43.849131500000006,
      "geo_longitude": 25.954425,
      "guest_count": 10,
      "host_name": null,
      "host_username": null,
      "location_city": "Ruse",
      "location_country": "Bulgaria",
      "max_capacity": null,
      "start_at": "2026-01-24T09:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2026-01-07T21:29:12.815",
      "duration_minutes": null,
      "end_at": "2026-01-24T17:00:00",
      "event_description": "Welcome to the first gathering of the Logos Circle Enugu!\nThis first event is a chance to meet and connect with your peers, align on purpose, and begin laying the groundwork for projects that matter. Everyone is welcome, whether you're ready to get involved or just curious to learn more.\nAgenda\nWelcome drinks and snacks\nEnjoy locally sourced snacks and drinks while we say hello and settle in.\nIntroductions\nGet to know your local Logos Circle Steward and community. You’ll be invited to share a bit about your story and why this work is meaningful to you.\nFocus on local issues\nA discussion about local initiatives already underway, emerging challenges, and how Logos can support through social action.\nFarewell!\nWe’ll share the roadmap for how you can get involved and when we’ll gather again.\nAbout Logos\nLogos is a fully decentralised, privacy-preserving, and politically neutral technology stack. The stack includes three modular, decentralised protocols: Blockchain, Messaging, and Storage. Combined, they provide the technical foundation for cyber states, parallel societies, network states, or any borderless public institution based on voluntary consent.\nLogos is also a collection of learning communities that will govern and sustain the network in the spirit of the original cypherpunks. Together, they form the grassroots movement needed to build the social, economic, and governing institutions that will live on the technology stack.\nEventually, these institutions will populate a competitive marketplace that can fill gaps in governance in the real world, providing trust-minimised, corruption-resistant public services wherever the internet can reach.",
      "event_id": "evt-C7Je70C8i3KWKZ3",
      "event_name": "Logos Circle Enugu",
      "event_status": null,
      "event_timezone": "Africa/Lagos",
      "event_type": null,
      "event_url": "https://luma.com/6p3rdhk9",
      "event_visibility": "public",
      "geo_latitude": 6.4392245,
      "geo_longitude": 7.515774899999999,
      "guest_count": 0,
      "host_name": null,
      "host_username": null,
      "location_city": "Enugu",
      "location_country": "Nigeria",
      "max_capacity": null,
      "start_at": "2026-01-24T15:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2026-01-16T15:54:56.892",
      "duration_minutes": null,
      "end_at": "2026-01-26T21:00:00",
      "event_description": "Welcome to the Logos Circle London chapter!\nWe believe real change starts at the local level. Join us in the heart of the City and its Square Mile - the best place to talk about parallel societies.\nEveryone is welcome, whether you're ready to get involved or just curious to learn more.\nAgenda\nWelcome and Intros\nFind us in The Wine Room at The Vintry EC4, where we will sit down and discuss what we've achieved, progress on our winnable issue, opportunities to get involved, solutions built by local members, and an open floor for relevant topics (privacy, exit, debt, activism, decentralisation, open source software, movement initiatives and more).\nSurfacing local issues\nThe circle encourages group discussions on local issues, emerging challenges, and active initiatives. Together we’ll explore where Logos tools and networks can support real-world action.\nGood to Know\nReserve some time to meet your local Logos Circle members. You’ll be invited to share a bit of your story, why you’re here and what draws you to this work.\n\nAbout Logos\nLogos is the sovereign private-by-default digital infrastructure and social movement built to revitalise civil society.\nRead our manifesto to dive deeper into our ideals and technology.",
      "event_id": "evt-EvVpEdRUMdvKJC0",
      "event_name": "Logos Circle London",
      "event_status": null,
      "event_timezone": "Europe/London",
      "event_type": null,
      "event_url": "https://luma.com/3vkwv6x3",
      "event_visibility": "public",
      "geo_latitude": 51.511534,
      "geo_longitude": -0.08853319999999999,
      "guest_count": 95,
      "host_name": null,
      "host_username": null,
      "location_city": "London",
      "location_country": "UK",
      "max_capacity": null,
      "start_at": "2026-01-26T18:00:00",
      "updated_at": null
    },
    {
      "category": null,
      "created_at": "2025-12-20T05:01:58.918",
      "duration_minutes": null,
      "end_at": "2026-01-31T15:00:00",
      "event_description": "Welcome to the first gathering of Logos Ebonyi Circle.\nFrom housing and food insecurity to digital autonomy and surveillance capitalism, we believe real change starts at the local level. This first event is a chance to meet and connect with your peers, align on purpose, and begin laying the groundwork for projects that matter. Everyone is welcome, whether you're ready to get involved or just curious to learn more.\nAgenda\nWelcome drinks and snacks\nEnjoy locally sourced snacks and drinks while we say hello and settle in.\nIntroductions\nGet to know your local Logos Circle Admins. You’ll be invited to share a bit about your story and why this work is meaningful to you.\nFocus on local issues\nA discussion about local initiatives already underway, emerging challenges, and how Logos can support through social action.\nFarewell!\nWe’ll share the roadmap for how you can get involved and when we’ll gather again.\nAbout Logos\n Logos is a fully decentralized, privacy-first, and politically neutral technology stack made up of three modular protocols: blockchain, messaging, and storage. Together, they form the infrastructure for cyber states, network societies, and borderless public institutions built on voluntary participation.\nEach month, we host a community circle focused on real-world challenges — from housing and food security to digital autonomy and surveillance. This inaugural gathering is an opportunity to connect with peers, align around shared values, and begin shaping meaningful, locally driven projects. Whether you’re actively looking to contribute or simply curious to learn, you’re welcome to join.\nLocation:Osborne La Palm Extension\n83QW+5FG, Kpiri Kpiri, Abakaliki 480106, Ebonyi, Nigeria\nAdd Further Instructions\nEvent Description\nWelcome to the first gathering of Logos Circle Lagos. From housing and food insecurity to digital autonomy and surveillance capitalism, we believe real change starts at the local level. This first event is a chance to meet and connect with your peers, align on purpose, and begin laying the groundwork for projects that matter. Everyone is welcome, whether you're ready to get involved or just curious to learn more. Agenda Welcome drinks and snacks Enjoy locally sourced snacks and drinks while we say hello and settle in. Introductions Get to know your local Logos Circle Admins. You’ll be invited to share a bit about your story and why this work is meaningful to you. Focus on local issues A discussion about local initiatives already underway, emerging challenges, and how Logos can support through social action. Farewell! We’ll share the roadmap for how you can get involved and when we’ll gather again. About Logos Logos is a fully decentralized, privacy-first, and politically neutral technology stack made up of three modular protocols: blockchain, messaging, and storage. Together, they form the infrastructure for cyber states, network societies, and borderless public institutions built on voluntary participation. Each month, we host a community circle focused on real-world challenges — from housing and food security to digital autonomy and surveillance. This inaugural gathering is an opportunity to connect with peers, align around shared values, and begin shaping meaningful, locally driven projects. Whether you’re actively looking to contribute or simply curious to learn, you’re welcome to join.",
      "event_id": "evt-RCmbhalv8vhhw1R",
      "event_name": "Logos Ebonyi Circle - A deep Dive to Logos Network",
      "event_status": null,
      "event_timezone": "Africa/Lagos",
      "event_type": null,
      "event_url": "https://luma.com/e282do8i",
      "event_visibility": "public",
      "geo_latitude": 6.337937999999999,
      "geo_longitude": 8.096192199999999,
      "guest_count": 1,
      "host_name": null,
      "host_username": null,
      "location_city": "Abakaliki",
      "location_country": "Nigeria",
      "max_capacity": null,
      "start_at": "2026-01-31T12:00:00",
      "updated_at": null
    }
  ]
}